
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine

/// Enum /Script/Debug.ELoggingOptions
/// Size: 0x01 (1 bytes)
enum class ELoggingOptions : uint8_t
{
	LO_Viewport                                                                      = 0,
	LO_Console                                                                       = 1,
	LO_Both                                                                          = 2,
	LO_NoLog                                                                         = 3
};

/// Enum /Script/Debug.EDebugLogType
/// Size: 0x01 (1 bytes)
enum class EDebugLogType : uint8_t
{
	DL_Info                                                                          = 0,
	DL_Success                                                                       = 1,
	DL_Warning                                                                       = 2,
	DL_Error                                                                         = 3,
	DL_Fatal                                                                         = 4
};

/// Enum /Script/Debug.EDebugLogComparisonMethod
/// Size: 0x01 (1 bytes)
enum class EDebugLogComparisonMethod : uint8_t
{
	CM_Equal_To                                                                      = 0,
	CM_Not_Equal_To                                                                  = 1,
	CM_Greater_Than_Or_Equal_To                                                      = 2,
	CM_Less_Than_Or_Equal_To                                                         = 3,
	CM_Greater_Than                                                                  = 4,
	CM_Less_Than                                                                     = 5
};

/// Enum /Script/Debug.EDebugLogTimeUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogTimeUnit : uint8_t
{
	DLTU_Nanoseconds                                                                 = 0,
	DLTU_Microseconds                                                                = 1,
	DLTU_Milliseconds                                                                = 2,
	DLTU_Seconds                                                                     = 3,
	DLTU_Minutes                                                                     = 4,
	DLTU_Hours                                                                       = 5,
	DLTU_Days                                                                        = 6,
	DLTU_Weeks                                                                       = 7,
	DLTU_Months                                                                      = 8,
	DLTU_Years                                                                       = 9,
	DLTU_Decades                                                                     = 10,
	DLTU_Centuries                                                                   = 11,
	DLTU_Millennium                                                                  = 12
};

/// Enum /Script/Debug.EDebugLogLightUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogLightUnit : uint8_t
{
	DLLU_Lumens                                                                      = 0,
	DLLU_Candela                                                                     = 1,
	DLLU_Lux                                                                         = 2,
	DLLU_CandelaPerMeter2                                                            = 3
};

/// Enum /Script/Debug.EDebugLogFrequencyUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogFrequencyUnit : uint8_t
{
	DLFU_Hertz                                                                       = 0,
	DLFU_Kilohertz                                                                   = 1,
	DLFU_Megahertz                                                                   = 2,
	DLFU_Gigahertz                                                                   = 3,
	DLFU_RevolutionsPerMinute                                                        = 4
};

/// Enum /Script/Debug.EDebugLogForceUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogForceUnit : uint8_t
{
	DLFU_Newtons                                                                     = 0,
	DLFU_PoundsForce                                                                 = 1,
	DLFU_KilogramsForce                                                              = 2
};

/// Enum /Script/Debug.EDebugLogAngularUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogAngularUnit : uint8_t
{
	DLAU_Degrees                                                                     = 0,
	DLAU_Radians                                                                     = 1
};

/// Enum /Script/Debug.EDebugLogSpeedUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogSpeedUnit : uint8_t
{
	DLSU_CentimetersPerSec                                                           = 0,
	DLSU_CentimetersPerHour                                                          = 1,
	DLSU_MicrometersPerSec                                                           = 2,
	DLSU_MicrometersPerHour                                                          = 3,
	DLSU_MillimetersPerSec                                                           = 4,
	DLSU_MillimetersPerHour                                                          = 5,
	DLSU_MetersPerSec                                                                = 6,
	DLSU_MetersPerHour                                                               = 7,
	DLSU_KilometersPerSec                                                            = 8,
	DLSU_KilometersPerHour                                                           = 9,
	DLSU_InchesPerSec                                                                = 10,
	DLSU_InchesPerHour                                                               = 11,
	DLSU_FeetPerSec                                                                  = 12,
	DLSU_FeetPerHour                                                                 = 13,
	DLSU_MilesPerSec                                                                 = 14,
	DLSU_MilesPerHour                                                                = 15,
	DLSU_YardsPerSec                                                                 = 16,
	DLSU_YardsPerHour                                                                = 17,
	DLSU_Knots                                                                       = 18
};

/// Enum /Script/Debug.EDebugLogMassUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogMassUnit : uint8_t
{
	DLMU_Microgram                                                                   = 0,
	DLMU_Milligram                                                                   = 1,
	DLMU_Gram                                                                        = 2,
	DLMU_Kilogram                                                                    = 3,
	DLMU_Tonne                                                                       = 4,
	DLMU_Ounce                                                                       = 5,
	DLMU_Pound                                                                       = 6,
	DLMU_Stone                                                                       = 7
};

/// Enum /Script/Debug.EDebugLogLengthUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogLengthUnit : uint8_t
{
	DLLU_Centimeter                                                                  = 0,
	DLLU_Micrometer                                                                  = 1,
	DLLU_Millimeter                                                                  = 2,
	DLLU_Meter                                                                       = 3,
	DLLU_Kilometer                                                                   = 4,
	DLLU_Inch                                                                        = 5,
	DLLU_Feet                                                                        = 6,
	DLLU_Mile                                                                        = 7,
	DLLU_NauticalMile                                                                = 8,
	DLLU_Yard                                                                        = 9,
	DLLU_Lightyears                                                                  = 10
};

/// Enum /Script/Debug.EDebugLogDataUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogDataUnit : uint8_t
{
	DLDU_Bit                                                                         = 0,
	DLDU_Byte                                                                        = 1,
	DLDU_Kilobyte                                                                    = 2,
	DLDU_Megabyte                                                                    = 3,
	DLDU_Gigabyte                                                                    = 4,
	DLDU_Terabyte                                                                    = 5,
	DLDU_Petabyte                                                                    = 6
};

/// Enum /Script/Debug.EDebugLogVolumeUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogVolumeUnit : uint8_t
{
	DLVU_Litre                                                                       = 0,
	DLVU_Millilitre                                                                  = 1,
	DLVU_Gallon                                                                      = 2,
	DLVU_Pint                                                                        = 3,
	DLVU_Quart                                                                       = 4
};

/// Enum /Script/Debug.EDebugLogTemperatureUnit
/// Size: 0x01 (1 bytes)
enum class EDebugLogTemperatureUnit : uint8_t
{
	DLTU_Celsius                                                                     = 0,
	DLTU_Fahrenheit                                                                  = 1,
	DLTU_Kelvin                                                                      = 2
};

/// Enum /Script/Debug.EDebugLogNumberSystems
/// Size: 0x01 (1 bytes)
enum class EDebugLogNumberSystems : uint8_t
{
	DLNS_Decimal                                                                     = 0,
	DLNS_Binary                                                                      = 1,
	DLNS_Hex                                                                         = 2,
	DLNS_Octal                                                                       = 3,
	DLNS_Roman                                                                       = 4
};

/// Class /Script/Debug.DebugLogLibrarySettings
/// Size: 0x00C8 (200 bytes) (0x000028 - 0x0000F0) align 8 pad: 0x0000
class UDebugLogLibrarySettings : public UObject
{ 
public:
	bool                                               bUseTwosComplimentForDecimalToHexConversionOnNegativeNumbers : 1; // 0x0028:0 (0x0001)  
	bool                                               bCrashGameInShippingBuildConfiguration : 1;                 // 0x0028:1 (0x0001)  
	bool                                               bSaveLogMessagesToCustomLogFile : 1;                        // 0x0028:2 (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0029   (0x0003)  MISSED
	FColor                                             InfoColor;                                                  // 0x002C   (0x0004)  
	FColor                                             ErrorColor;                                                 // 0x0030   (0x0004)  
	FColor                                             WarningColor;                                               // 0x0034   (0x0004)  
	FColor                                             SuccessColor;                                               // 0x0038   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	SDK_UNDEFINED(80,564) /* TMap<FName, int32_t> */   __um(ViewportLogKeys);                                      // 0x0040   (0x0050)  
	bool                                               bEnableSpecifiers : 1;                                      // 0x0090:0 (0x0001)  
	TEnumAsByte<ELoggingOptions>                       DisplaySpecifiersIn;                                        // 0x0091   (0x0001)  
	unsigned char                                      UnknownData02_6[0x6];                                       // 0x0092   (0x0006)  MISSED
	SDK_UNDEFINED(80,565) /* TMap<TEnumAsByte<EDebugLogType>, FString> */ __um(LogCategorySpecifiers);             // 0x0098   (0x0050)  
	bool                                               bLogContext : 1;                                            // 0x00E8:0 (0x0001)  
	TEnumAsByte<ELoggingOptions>                       DisplayContextIn;                                           // 0x00E9   (0x0001)  
	unsigned char                                      UnknownData03_7[0x6];                                       // 0x00EA   (0x0006)  MISSED
};

/// Class /Script/Debug.Log
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class ULog : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Debug.Log.Yo
	// void Yo(TEnumAsByte<ELoggingOptions> LoggingOption, FName ViewportKeyName, class UObject* ContextObject);                // [0xa49c50] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Debug.Log.Yes
	// void Yes(FString Prefix, FString Suffix, TEnumAsByte<ELoggingOptions> LoggingOption, FName ViewportKeyName, class UObject* ContextObject); // [0xa49aa0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Debug.Log.Wassup
	// void Wassup(TEnumAsByte<ELoggingOptions> LoggingOption, FName ViewportKeyName, class UObject* ContextObject);            // [0xa499a0] Final|Native|Static|Public|BlueprintCallable 
