
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine

/// Enum /Script/Zeuzsdk.EZeuzSessionType
/// Size: 0x01 (1 bytes)
enum class EZeuzSessionType : uint8_t
{
	EZeuzSessionType__ST_Developer                                                   = 0,
	EZeuzSessionType__ST_ApiKey                                                      = 1,
	EZeuzSessionType__ST_User                                                        = 2
};

/// Enum /Script/Zeuzsdk.ZeuzIDType
/// Size: 0x01 (1 bytes)
enum class ZeuzIDType : uint8_t
{
	ZeuzIDType__Invalid                                                              = 0,
	ZeuzIDType__Account                                                              = 1,
	ZeuzIDType__Proj                                                                 = 16,
	ZeuzIDType__Env                                                                  = 17,
	ZeuzIDType__User                                                                 = 18,
	ZeuzIDType__Developer                                                            = 19,
	ZeuzIDType__Team                                                                 = 20,
	ZeuzIDType__Session                                                              = 32,
	ZeuzIDType__TempFile                                                             = 49,
	ZeuzIDType__Lobby                                                                = 50,
	ZeuzIDType__MatchMaking                                                          = 51,
	ZeuzIDType__Message                                                              = 52,
	ZeuzIDType__Inbox                                                                = 53,
	ZeuzIDType__ConfigRule                                                           = 64,
	ZeuzIDType__APIKey                                                               = 99
};

/// Class /Script/Zeuzsdk.ZeuzApiAccount
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiAccount : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamupdateBPS__DelegateSignature
	// void DelegateAccountTeamupdateBPS__DelegateSignature();                                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamupdateBPF__DelegateSignature
	// void DelegateAccountTeamupdateBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamupdateBP__DelegateSignature
	// void DelegateAccountTeamupdateBP__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamgetBPS__DelegateSignature
	// void DelegateAccountTeamgetBPS__DelegateSignature(FZeuzTeam Result);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamgetBPF__DelegateSignature
	// void DelegateAccountTeamgetBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamgetBP__DelegateSignature
	// void DelegateAccountTeamgetBP__DelegateSignature(FZeuzTeam Result, FString Error);                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamdeleteBPS__DelegateSignature
	// void DelegateAccountTeamdeleteBPS__DelegateSignature();                                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamdeleteBPF__DelegateSignature
	// void DelegateAccountTeamdeleteBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamdeleteBP__DelegateSignature
	// void DelegateAccountTeamdeleteBP__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamcreateBPS__DelegateSignature
	// void DelegateAccountTeamcreateBPS__DelegateSignature(FString Result);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamcreateBPF__DelegateSignature
	// void DelegateAccountTeamcreateBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamcreateBP__DelegateSignature
	// void DelegateAccountTeamcreateBP__DelegateSignature(FString Result, FString Error);                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotasetBPS__DelegateSignature
	// void DelegateAccountQuotasetBPS__DelegateSignature(FZeuzAccountQuotaInfo& Result);                                       // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotasetBPF__DelegateSignature
	// void DelegateAccountQuotasetBPF__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotasetBP__DelegateSignature
	// void DelegateAccountQuotasetBP__DelegateSignature(FZeuzAccountQuotaInfo& Result, FString Error);                         // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotagetBPS__DelegateSignature
	// void DelegateAccountQuotagetBPS__DelegateSignature(FZeuzAccountQuotaInfo& Result);                                       // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotagetBPF__DelegateSignature
	// void DelegateAccountQuotagetBPF__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotagetBP__DelegateSignature
	// void DelegateAccountQuotagetBP__DelegateSignature(FZeuzAccountQuotaInfo& Result, FString Error);                         // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectupdateBPS__DelegateSignature
	// void DelegateAccountProjectupdateBPS__DelegateSignature();                                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectupdateBPF__DelegateSignature
	// void DelegateAccountProjectupdateBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectupdateBP__DelegateSignature
	// void DelegateAccountProjectupdateBP__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectsgetBPS__DelegateSignature
	// void DelegateAccountProjectsgetBPS__DelegateSignature(TArray<FZeuzProj>& Result);                                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectsgetBPF__DelegateSignature
	// void DelegateAccountProjectsgetBPF__DelegateSignature(FString Error);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectsgetBP__DelegateSignature
	// void DelegateAccountProjectsgetBP__DelegateSignature(TArray<FZeuzProj>& Result, FString Error);                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectgetBPS__DelegateSignature
	// void DelegateAccountProjectgetBPS__DelegateSignature(FZeuzProj Result);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectgetBPF__DelegateSignature
	// void DelegateAccountProjectgetBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectgetBP__DelegateSignature
	// void DelegateAccountProjectgetBP__DelegateSignature(FZeuzProj Result, FString Error);                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectdeleteBPS__DelegateSignature
	// void DelegateAccountProjectdeleteBPS__DelegateSignature();                                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectdeleteBPF__DelegateSignature
	// void DelegateAccountProjectdeleteBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectdeleteBP__DelegateSignature
	// void DelegateAccountProjectdeleteBP__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectcreateBPS__DelegateSignature
	// void DelegateAccountProjectcreateBPS__DelegateSignature(FString Result);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectcreateBPF__DelegateSignature
	// void DelegateAccountProjectcreateBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectcreateBP__DelegateSignature
	// void DelegateAccountProjectcreateBP__DelegateSignature(FString Result, FString Error);                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvupdateBPS__DelegateSignature
	// void DelegateAccountEnvupdateBPS__DelegateSignature();                                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvupdateBPF__DelegateSignature
	// void DelegateAccountEnvupdateBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvupdateBP__DelegateSignature
	// void DelegateAccountEnvupdateBP__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvsgetBPS__DelegateSignature
	// void DelegateAccountEnvsgetBPS__DelegateSignature(TArray<FZeuzEnv>& Result);                                             // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvsgetBPF__DelegateSignature
	// void DelegateAccountEnvsgetBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvsgetBP__DelegateSignature
	// void DelegateAccountEnvsgetBP__DelegateSignature(TArray<FZeuzEnv>& Result, FString Error);                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvserviceupdateBPS__DelegateSignature
	// void DelegateAccountEnvserviceupdateBPS__DelegateSignature();                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvserviceupdateBPF__DelegateSignature
	// void DelegateAccountEnvserviceupdateBPF__DelegateSignature(FString Error);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvserviceupdateBP__DelegateSignature
	// void DelegateAccountEnvserviceupdateBP__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvservicedeleteBPS__DelegateSignature
	// void DelegateAccountEnvservicedeleteBPS__DelegateSignature();                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvservicedeleteBPF__DelegateSignature
	// void DelegateAccountEnvservicedeleteBPF__DelegateSignature(FString Error);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvservicedeleteBP__DelegateSignature
	// void DelegateAccountEnvservicedeleteBP__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvgetBPS__DelegateSignature
	// void DelegateAccountEnvgetBPS__DelegateSignature(FZeuzEnv Result);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvgetBPF__DelegateSignature
	// void DelegateAccountEnvgetBPF__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvgetBP__DelegateSignature
	// void DelegateAccountEnvgetBP__DelegateSignature(FZeuzEnv Result, FString Error);                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvdeleteBPS__DelegateSignature
	// void DelegateAccountEnvdeleteBPS__DelegateSignature();                                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvdeleteBPF__DelegateSignature
	// void DelegateAccountEnvdeleteBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvdeleteBP__DelegateSignature
	// void DelegateAccountEnvdeleteBP__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvcreateBPS__DelegateSignature
	// void DelegateAccountEnvcreateBPS__DelegateSignature(FString Result);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvcreateBPF__DelegateSignature
	// void DelegateAccountEnvcreateBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvcreateBP__DelegateSignature
	// void DelegateAccountEnvcreateBP__DelegateSignature(FString Result, FString Error);                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevquicksetupBPS__DelegateSignature
	// void DelegateAccountDevquicksetupBPS__DelegateSignature(FZeuzAccountDevQuickSetupOut& Result);                           // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevquicksetupBPF__DelegateSignature
	// void DelegateAccountDevquicksetupBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevquicksetupBP__DelegateSignature
	// void DelegateAccountDevquicksetupBP__DelegateSignature(FZeuzAccountDevQuickSetupOut& Result, FString Error);             // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperupdateBPS__DelegateSignature
	// void DelegateAccountDeveloperupdateBPS__DelegateSignature();                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperupdateBPF__DelegateSignature
	// void DelegateAccountDeveloperupdateBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperupdateBP__DelegateSignature
	// void DelegateAccountDeveloperupdateBP__DelegateSignature(FString Error);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersgetBPS__DelegateSignature
	// void DelegateAccountDevelopersgetBPS__DelegateSignature(TArray<FZeuzDeveloper>& Result);                                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersgetBPF__DelegateSignature
	// void DelegateAccountDevelopersgetBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersgetBP__DelegateSignature
	// void DelegateAccountDevelopersgetBP__DelegateSignature(TArray<FZeuzDeveloper>& Result, FString Error);                   // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersetpwhashBPS__DelegateSignature
	// void DelegateAccountDevelopersetpwhashBPS__DelegateSignature(FZeuzDeveloper Result);                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersetpwhashBPF__DelegateSignature
	// void DelegateAccountDevelopersetpwhashBPF__DelegateSignature(FString Error);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersetpwhashBP__DelegateSignature
	// void DelegateAccountDevelopersetpwhashBP__DelegateSignature(FZeuzDeveloper Result, FString Error);                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperrevokeBPS__DelegateSignature
	// void DelegateAccountDeveloperrevokeBPS__DelegateSignature();                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperrevokeBPF__DelegateSignature
	// void DelegateAccountDeveloperrevokeBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperrevokeBP__DelegateSignature
	// void DelegateAccountDeveloperrevokeBP__DelegateSignature(FString Error);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetrequestBPS__DelegateSignature
	// void DelegateAccountDeveloperpasswordresetrequestBPS__DelegateSignature();                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetrequestBPF__DelegateSignature
	// void DelegateAccountDeveloperpasswordresetrequestBPF__DelegateSignature(FString Error);                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetrequestBP__DelegateSignature
	// void DelegateAccountDeveloperpasswordresetrequestBP__DelegateSignature(FString Error);                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetBPS__DelegateSignature
	// void DelegateAccountDeveloperpasswordresetBPS__DelegateSignature();                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetBPF__DelegateSignature
	// void DelegateAccountDeveloperpasswordresetBPF__DelegateSignature(FString Error);                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetBP__DelegateSignature
	// void DelegateAccountDeveloperpasswordresetBP__DelegateSignature(FString Error);                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperispasswordresethashexpiredBPS__DelegateSignature
	// void DelegateAccountDeveloperispasswordresethashexpiredBPS__DelegateSignature(bool Result);                              // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperispasswordresethashexpiredBPF__DelegateSignature
	// void DelegateAccountDeveloperispasswordresethashexpiredBPF__DelegateSignature(FString Error);                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperispasswordresethashexpiredBP__DelegateSignature
	// void DelegateAccountDeveloperispasswordresethashexpiredBP__DelegateSignature(bool Result, FString Error);                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperinviteBPS__DelegateSignature
	// void DelegateAccountDeveloperinviteBPS__DelegateSignature(FString Result);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperinviteBPF__DelegateSignature
	// void DelegateAccountDeveloperinviteBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperinviteBP__DelegateSignature
	// void DelegateAccountDeveloperinviteBP__DelegateSignature(FString Result, FString Error);                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopergetBPS__DelegateSignature
	// void DelegateAccountDevelopergetBPS__DelegateSignature(FZeuzDeveloper Result);                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopergetBPF__DelegateSignature
	// void DelegateAccountDevelopergetBPF__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopergetBP__DelegateSignature
	// void DelegateAccountDevelopergetBP__DelegateSignature(FZeuzDeveloper Result, FString Error);                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreatepwhashBPS__DelegateSignature
	// void DelegateAccountDevelopercreatepwhashBPS__DelegateSignature(FZeuzDeveloper Result);                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreatepwhashBPF__DelegateSignature
	// void DelegateAccountDevelopercreatepwhashBPF__DelegateSignature(FString Error);                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreatepwhashBP__DelegateSignature
	// void DelegateAccountDevelopercreatepwhashBP__DelegateSignature(FZeuzDeveloper Result, FString Error);                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreateBPS__DelegateSignature
	// void DelegateAccountDevelopercreateBPS__DelegateSignature(FString Result);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreateBPF__DelegateSignature
	// void DelegateAccountDevelopercreateBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreateBP__DelegateSignature
	// void DelegateAccountDevelopercreateBP__DelegateSignature(FString Result, FString Error);                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountupdateBPS__DelegateSignature
	// void DelegateAccountAccountupdateBPS__DelegateSignature();                                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountupdateBPF__DelegateSignature
	// void DelegateAccountAccountupdateBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountupdateBP__DelegateSignature
	// void DelegateAccountAccountupdateBP__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountgetBPS__DelegateSignature
	// void DelegateAccountAccountgetBPS__DelegateSignature(FZeuzAccount Result);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountgetBPF__DelegateSignature
	// void DelegateAccountAccountgetBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountgetBP__DelegateSignature
	// void DelegateAccountAccountgetBP__DelegateSignature(FZeuzAccount Result, FString Error);                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountcreateBPS__DelegateSignature
	// void DelegateAccountAccountcreateBPS__DelegateSignature(FString Result);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountcreateBPF__DelegateSignature
	// void DelegateAccountAccountcreateBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountcreateBP__DelegateSignature
	// void DelegateAccountAccountcreateBP__DelegateSignature(FString Result, FString Error);                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountTeamupdateBP
	// void AccountTeamupdateBP(FZeuzTeam In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xade4f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountTeamgetBP
	// void AccountTeamgetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xade1d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountTeamdeleteBP
	// void AccountTeamdeleteBP(FZeuzAccountTeamDeleteIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadded0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountTeamcreateBP
	// void AccountTeamcreateBP(FZeuzAccountTeamCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaddb00] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountQuotasetBP
	// void AccountQuotasetBP(FZeuzAccountQuotaInfo& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadd810] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountQuotagetBP
	// void AccountQuotagetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadd4f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountProjectupdateBP
	// void AccountProjectupdateBP(FZeuzProj In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadcc90] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountProjectsgetBP
	// void AccountProjectsgetBP(TArray<FString>& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadc980] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountProjectgetBP
	// void AccountProjectgetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadc660] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountProjectdeleteBP
	// void AccountProjectdeleteBP(FZeuzAccountProjectDeleteIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadc360] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountProjectcreateBP
	// void AccountProjectcreateBP(FZeuzAccountProjectCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadbfd0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountEnvupdateBP
	// void AccountEnvupdateBP(FZeuzEnv In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadb6c0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountEnvsgetBP
	// void AccountEnvsgetBP(TArray<FString>& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadb3b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountEnvserviceupdateBP
	// void AccountEnvserviceupdateBP(FZeuzServiceCfg In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadb010] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountEnvservicedeleteBP
	// void AccountEnvservicedeleteBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xadacf0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountEnvgetBP
	// void AccountEnvgetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xada9d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountEnvdeleteBP
	// void AccountEnvdeleteBP(FZeuzAccountEnvDeleteIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xada6d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountEnvcreateBP
	// void AccountEnvcreateBP(FZeuzAccountEnvCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xada340] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDevquicksetupBP
	// void AccountDevquicksetupBP(FZeuzAccountDevQuickSetupIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xada020] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDeveloperupdateBP
	// void AccountDeveloperupdateBP(FZeuzDeveloper In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad9630] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDevelopersgetBP
	// void AccountDevelopersgetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad9310] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDevelopersetpwhashBP
	// void AccountDevelopersetpwhashBP(FZeuzAccountDeveloperSetPwHashIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad9010] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDeveloperrevokeBP
	// void AccountDeveloperrevokeBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad8cf0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDeveloperpasswordresetrequestBP
	// void AccountDeveloperpasswordresetrequestBP(FZeuzAccountDeveloperPasswordResetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad89f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDeveloperpasswordresetBP
	// void AccountDeveloperpasswordresetBP(FZeuzAccountDeveloperPasswordResetExecuteRequestIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad86c0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDeveloperispasswordresethashexpiredBP
	// void AccountDeveloperispasswordresethashexpiredBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad83a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDeveloperinviteBP
	// void AccountDeveloperinviteBP(FZeuzAccountDeveloperCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad7fe0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDevelopergetBP
	// void AccountDevelopergetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad7cc0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDevelopercreatepwhashBP
	// void AccountDevelopercreatepwhashBP(FZeuzAccountDeveloperCreatePwHashIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad7990] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountDevelopercreateBP
	// void AccountDevelopercreateBP(FZeuzAccountDeveloperCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad75d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountAccountupdateBP
	// void AccountAccountupdateBP(FZeuzAccount In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad72e0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountAccountgetBP
	// void AccountAccountgetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad6fc0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAccount.AccountAccountcreateBP
	// void AccountAccountcreateBP(FZeuzAccountCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xad6ac0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/Zeuzsdk.ZeuzApiAdmin
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiAdmin : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminStatsBPS__DelegateSignature
	// void DelegateAdminStatsBPS__DelegateSignature(FZeuzAdminStatsOut& Result);                                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminStatsBPF__DelegateSignature
	// void DelegateAdminStatsBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminStatsBP__DelegateSignature
	// void DelegateAdminStatsBP__DelegateSignature(FZeuzAdminStatsOut& Result, FString Error);                                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminProjectsBPS__DelegateSignature
	// void DelegateAdminProjectsBPS__DelegateSignature(TArray<FZeuzProj>& Result);                                             // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminProjectsBPF__DelegateSignature
	// void DelegateAdminProjectsBPF__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminProjectsBP__DelegateSignature
	// void DelegateAdminProjectsBP__DelegateSignature(TArray<FZeuzProj>& Result, FString Error);                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminLogsBPS__DelegateSignature
	// void DelegateAdminLogsBPS__DelegateSignature(FZeuzLogsearchOut Result);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminLogsBPF__DelegateSignature
	// void DelegateAdminLogsBPF__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminLogsBP__DelegateSignature
	// void DelegateAdminLogsBP__DelegateSignature(FZeuzLogsearchOut Result, FString Error);                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminItemsBPS__DelegateSignature
	// void DelegateAdminItemsBPS__DelegateSignature(FZeuzAdminItemsOut& Result);                                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminItemsBPF__DelegateSignature
	// void DelegateAdminItemsBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminItemsBP__DelegateSignature
	// void DelegateAdminItemsBP__DelegateSignature(FZeuzAdminItemsOut& Result, FString Error);                                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminGetquotaBPS__DelegateSignature
	// void DelegateAdminGetquotaBPS__DelegateSignature(int32_t Result);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminGetquotaBPF__DelegateSignature
	// void DelegateAdminGetquotaBPF__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminGetquotaBP__DelegateSignature
	// void DelegateAdminGetquotaBP__DelegateSignature(int32_t Result, FString Error);                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminEnvironmentsBPS__DelegateSignature
	// void DelegateAdminEnvironmentsBPS__DelegateSignature(TArray<FZeuzEnv>& Result);                                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminEnvironmentsBPF__DelegateSignature
	// void DelegateAdminEnvironmentsBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminEnvironmentsBP__DelegateSignature
	// void DelegateAdminEnvironmentsBP__DelegateSignature(TArray<FZeuzEnv>& Result, FString Error);                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminDevelopersBPS__DelegateSignature
	// void DelegateAdminDevelopersBPS__DelegateSignature(TArray<FZeuzDeveloper>& Result);                                      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminDevelopersBPF__DelegateSignature
	// void DelegateAdminDevelopersBPF__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminDevelopersBP__DelegateSignature
	// void DelegateAdminDevelopersBP__DelegateSignature(TArray<FZeuzDeveloper>& Result, FString Error);                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesperaccBPS__DelegateSignature
	// void DelegateAdminCountresourcesperaccBPS__DelegateSignature(TArray<FZeuzAdminCountResoucesPerAccountOut>& Result);      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesperaccBPF__DelegateSignature
	// void DelegateAdminCountresourcesperaccBPF__DelegateSignature(FString Error);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesperaccBP__DelegateSignature
	// void DelegateAdminCountresourcesperaccBP__DelegateSignature(TArray<FZeuzAdminCountResoucesPerAccountOut>& Result, FString Error); // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesBPS__DelegateSignature
	// void DelegateAdminCountresourcesBPS__DelegateSignature(int32_t Result);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesBPF__DelegateSignature
	// void DelegateAdminCountresourcesBPF__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesBP__DelegateSignature
	// void DelegateAdminCountresourcesBP__DelegateSignature(int32_t Result, FString Error);                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminAccountsBPS__DelegateSignature
	// void DelegateAdminAccountsBPS__DelegateSignature(TArray<FZeuzAccount>& Result);                                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminAccountsBPF__DelegateSignature
	// void DelegateAdminAccountsBPF__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.DelegateAdminAccountsBP__DelegateSignature
	// void DelegateAdminAccountsBP__DelegateSignature(TArray<FZeuzAccount>& Result, FString Error);                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminStatsBP
	// void AdminStatsBP(FZeuzAdminStatsIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae3a80] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminProjectsBP
	// void AdminProjectsBP(FZeuzAdminAccountIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae3790] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminLogsBP
	// void AdminLogsBP(FZeuzAdminLogsIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae3460] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminItemsBP
	// void AdminItemsBP(FZeuzAdminItemsIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae3160] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminGetquotaBP
	// void AdminGetquotaBP(FZeuzAdminTestpoolIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae2e70] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminEnvironmentsBP
	// void AdminEnvironmentsBP(FZeuzAdminEnvIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae2b80] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminDevelopersBP
	// void AdminDevelopersBP(FZeuzAdminAccountIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae2890] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminCountresourcesperaccBP
	// void AdminCountresourcesperaccBP(FZeuzAdminTestpoolIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae25a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminCountresourcesBP
	// void AdminCountresourcesBP(FZeuzAdminCountResoucesIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae22b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAdmin.AdminAccountsBP
	// void AdminAccountsBP(FZeuzAdminAccountsIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae1fe0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/Zeuzsdk.ZeuzApiAllocation
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiAllocation : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationUpdateBPS__DelegateSignature
	// void DelegateAllocationUpdateBPS__DelegateSignature(FZeuzAllocationInfo& Result);                                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationUpdateBPF__DelegateSignature
	// void DelegateAllocationUpdateBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationUpdateBP__DelegateSignature
	// void DelegateAllocationUpdateBP__DelegateSignature(FZeuzAllocationInfo& Result, FString Error);                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationRequestServicesBPS__DelegateSignature
	// void DelegateAllocationRequestServicesBPS__DelegateSignature(TArray<FZeuzAllocationPayloadInfo>& Result);                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationRequestServicesBPF__DelegateSignature
	// void DelegateAllocationRequestServicesBPF__DelegateSignature(FString Error);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationRequestServicesBP__DelegateSignature
	// void DelegateAllocationRequestServicesBP__DelegateSignature(TArray<FZeuzAllocationPayloadInfo>& Result, FString Error);  // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationGetBPS__DelegateSignature
	// void DelegateAllocationGetBPS__DelegateSignature(FZeuzAllocationGetOut& Result);                                         // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationGetBPF__DelegateSignature
	// void DelegateAllocationGetBPF__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationGetBP__DelegateSignature
	// void DelegateAllocationGetBP__DelegateSignature(FZeuzAllocationGetOut& Result, FString Error);                           // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationCreateBPS__DelegateSignature
	// void DelegateAllocationCreateBPS__DelegateSignature(FZeuzAllocationInfo& Result);                                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationCreateBPF__DelegateSignature
	// void DelegateAllocationCreateBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.DelegateAllocationCreateBP__DelegateSignature
	// void DelegateAllocationCreateBP__DelegateSignature(FZeuzAllocationInfo& Result, FString Error);                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.AllocationUpdateBP
	// void AllocationUpdateBP(FZeuzAllocationUpdateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae83a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.AllocationRequestServicesBP
	// void AllocationRequestServicesBP(FZeuzAllocationRequestServiceIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae8070] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.AllocationGetBP
	// void AllocationGetBP(FZeuzAllocationGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae7d00] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAllocation.AllocationCreateBP
	// void AllocationCreateBP(FZeuzAllocationCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae79e0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/Zeuzsdk.ZeuzApiApikey
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiApikey : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyUpdateBPS__DelegateSignature
	// void DelegateApikeyUpdateBPS__DelegateSignature(FZeuzAPIKey Result);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyUpdateBPF__DelegateSignature
	// void DelegateApikeyUpdateBPF__DelegateSignature(FString Error);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyUpdateBP__DelegateSignature
	// void DelegateApikeyUpdateBP__DelegateSignature(FZeuzAPIKey Result, FString Error);                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeySetpwhashBPS__DelegateSignature
	// void DelegateApikeySetpwhashBPS__DelegateSignature(FZeuzAPIKey Result);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeySetpwhashBPF__DelegateSignature
	// void DelegateApikeySetpwhashBPF__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeySetpwhashBP__DelegateSignature
	// void DelegateApikeySetpwhashBP__DelegateSignature(FZeuzAPIKey Result, FString Error);                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyRevokeBPS__DelegateSignature
	// void DelegateApikeyRevokeBPS__DelegateSignature();                                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyRevokeBPF__DelegateSignature
	// void DelegateApikeyRevokeBPF__DelegateSignature(FString Error);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyRevokeBP__DelegateSignature
	// void DelegateApikeyRevokeBP__DelegateSignature(FString Error);                                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetBPS__DelegateSignature
	// void DelegateApikeyGetBPS__DelegateSignature(TArray<FZeuzAPIKey>& Result);                                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetBPF__DelegateSignature
	// void DelegateApikeyGetBPF__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetBP__DelegateSignature
	// void DelegateApikeyGetBP__DelegateSignature(TArray<FZeuzAPIKey>& Result, FString Error);                                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetallBPS__DelegateSignature
	// void DelegateApikeyGetallBPS__DelegateSignature(TArray<FZeuzAPIKey>& Result);                                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetallBPF__DelegateSignature
	// void DelegateApikeyGetallBPF__DelegateSignature(FString Error);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetallBP__DelegateSignature
	// void DelegateApikeyGetallBP__DelegateSignature(TArray<FZeuzAPIKey>& Result, FString Error);                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyGenerateBPS__DelegateSignature
	// void DelegateApikeyGenerateBPS__DelegateSignature(FZeuzAPIKey Result);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyGenerateBPF__DelegateSignature
	// void DelegateApikeyGenerateBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyGenerateBP__DelegateSignature
	// void DelegateApikeyGenerateBP__DelegateSignature(FZeuzAPIKey Result, FString Error);                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyDeleteBPS__DelegateSignature
	// void DelegateApikeyDeleteBPS__DelegateSignature();                                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyDeleteBPF__DelegateSignature
	// void DelegateApikeyDeleteBPF__DelegateSignature(FString Error);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyDeleteBP__DelegateSignature
	// void DelegateApikeyDeleteBP__DelegateSignature(FString Error);                                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyCreateBPS__DelegateSignature
	// void DelegateApikeyCreateBPS__DelegateSignature(FZeuzAPIKey Result);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyCreateBPF__DelegateSignature
	// void DelegateApikeyCreateBPF__DelegateSignature(FString Error);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.DelegateApikeyCreateBP__DelegateSignature
	// void DelegateApikeyCreateBP__DelegateSignature(FZeuzAPIKey Result, FString Error);                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiApikey.ApikeyUpdateBP
	// void ApikeyUpdateBP(FZeuzAPIKey In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaea0d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.ApikeySetpwhashBP
	// void ApikeySetpwhashBP(FZeuzAPIKeyPwHashIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae9db0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.ApikeyRevokeBP
	// void ApikeyRevokeBP(FZeuzAPIKeyDeleteIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae9ab0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.ApikeyGetBP
	// void ApikeyGetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae9480] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.ApikeyGetallBP
	// void ApikeyGetallBP(FZeuzAPIKeyGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae97a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.ApikeyGenerateBP
	// void ApikeyGenerateBP(FZeuzAPIKeyGenerateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae9180] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.ApikeyDeleteBP
	// void ApikeyDeleteBP(FZeuzAPIKeyDeleteIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae8e80] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiApikey.ApikeyCreateBP
	// void ApikeyCreateBP(FZeuzAPIKey In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xae86b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/Zeuzsdk.ZeuzApiAuth
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiAuth : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthSessiondelBPS__DelegateSignature
	// void DelegateAuthSessiondelBPS__DelegateSignature();                                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthSessiondelBPF__DelegateSignature
	// void DelegateAuthSessiondelBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthSessiondelBP__DelegateSignature
	// void DelegateAuthSessiondelBP__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthLogoutBPS__DelegateSignature
	// void DelegateAuthLogoutBPS__DelegateSignature();                                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthLogoutBPF__DelegateSignature
	// void DelegateAuthLogoutBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthLogoutBP__DelegateSignature
	// void DelegateAuthLogoutBP__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthLoginBPS__DelegateSignature
	// void DelegateAuthLoginBPS__DelegateSignature(FZeuzAuthLoginResult Result);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthLoginBPF__DelegateSignature
	// void DelegateAuthLoginBPF__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthLoginBP__DelegateSignature
	// void DelegateAuthLoginBP__DelegateSignature(FZeuzAuthLoginResult Result, FString Error);                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthCheckBPS__DelegateSignature
	// void DelegateAuthCheckBPS__DelegateSignature(FZeuzTimestamp Result);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthCheckBPF__DelegateSignature
	// void DelegateAuthCheckBPF__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthCheckBP__DelegateSignature
	// void DelegateAuthCheckBP__DelegateSignature(FZeuzTimestamp Result, FString Error);                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthActivesessionsgetBPS__DelegateSignature
	// void DelegateAuthActivesessionsgetBPS__DelegateSignature(TArray<FZeuzSession>& Result);                                  // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthActivesessionsgetBPF__DelegateSignature
	// void DelegateAuthActivesessionsgetBPF__DelegateSignature(FString Error);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiAuth.DelegateAuthActivesessionsgetBP__DelegateSignature
	// void DelegateAuthActivesessionsgetBP__DelegateSignature(TArray<FZeuzSession>& Result, FString Error);                    // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiAuth.AuthSessiondelBP
	// void AuthSessiondelBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaee070] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAuth.AuthLogoutBP
	// void AuthLogoutBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaedd50] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAuth.AuthLoginBP
	// void AuthLoginBP(FZeuzAuthLoginIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaeda30] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAuth.AuthCheckBP
	// void AuthCheckBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaed710] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiAuth.AuthActivesessionsgetBP
	// void AuthActivesessionsgetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaed3f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/Zeuzsdk.ZeuzApiEcho
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiEcho : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiEcho.Echo4BP
	// void Echo4BP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaeec40] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiEcho.Echo3BP
	// void Echo3BP(FZeuzEcho3In& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaee970] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiEcho.Echo2BP
	// void Echo2BP(FZeuzEcho2In& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaee680] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiEcho.Echo1BP
	// void Echo1BP(FZeuzEchoIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaee390] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho4BPS__DelegateSignature
	// void DelegateEcho4BPS__DelegateSignature(FString Result);                                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho4BPF__DelegateSignature
	// void DelegateEcho4BPF__DelegateSignature(FString Error);                                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho4BP__DelegateSignature
	// void DelegateEcho4BP__DelegateSignature(FString Result, FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho3BPS__DelegateSignature
	// void DelegateEcho3BPS__DelegateSignature(FZeuzEchoOut& Result);                                                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho3BPF__DelegateSignature
	// void DelegateEcho3BPF__DelegateSignature(FString Error);                                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho3BP__DelegateSignature
	// void DelegateEcho3BP__DelegateSignature(FZeuzEchoOut& Result, FString Error);                                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho2BPS__DelegateSignature
	// void DelegateEcho2BPS__DelegateSignature(FZeuzEcho2Out& Result);                                                         // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho2BPF__DelegateSignature
	// void DelegateEcho2BPF__DelegateSignature(FString Error);                                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho2BP__DelegateSignature
	// void DelegateEcho2BP__DelegateSignature(FZeuzEcho2Out& Result, FString Error);                                           // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho1BPS__DelegateSignature
	// void DelegateEcho1BPS__DelegateSignature(FZeuzEchoOut& Result);                                                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho1BPF__DelegateSignature
	// void DelegateEcho1BPF__DelegateSignature(FString Error);                                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiEcho.DelegateEcho1BP__DelegateSignature
	// void DelegateEcho1BP__DelegateSignature(FZeuzEchoOut& Result, FString Error);                                            // [0x24710f0] Public|Delegate|HasOutParms 
};

/// Class /Script/Zeuzsdk.ZeuzApiImagemanager
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiImagemanager : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPushFileUrlBP
	// void ImagemanagerPushFileUrlBP(FZeuzImageManagerPresignedFileUrlIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf03f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPushBP
	// void ImagemanagerPushBP(FZeuzImageManagerManifest& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf0070] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPullFileUrlBP
	// void ImagemanagerPullFileUrlBP(FZeuzImageManagerPresignedFileUrlIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaefd70] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPullBP
	// void ImagemanagerPullBP(FZeuzImageManagerPullInput& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaefa80] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPublishBP
	// void ImagemanagerPublishBP(FZeuzImageManagerPublishInput& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaef780] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.ImagemanagerListBP
	// void ImagemanagerListBP(FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaef500] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.ImagemanagerGetpublishstateBP
	// void ImagemanagerGetpublishstateBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaef1e0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.ImagemanagerDiscardBP
	// void ImagemanagerDiscardBP(FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaeef60] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushFileUrlBPS__DelegateSignature
	// void DelegateImagemanagerPushFileUrlBPS__DelegateSignature(FString Result);                                              // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushFileUrlBPF__DelegateSignature
	// void DelegateImagemanagerPushFileUrlBPF__DelegateSignature(FString Error);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushFileUrlBP__DelegateSignature
	// void DelegateImagemanagerPushFileUrlBP__DelegateSignature(FString Result, FString Error);                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushBPS__DelegateSignature
	// void DelegateImagemanagerPushBPS__DelegateSignature(FZeuzImageManagerPushPullOutput& Result);                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushBPF__DelegateSignature
	// void DelegateImagemanagerPushBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushBP__DelegateSignature
	// void DelegateImagemanagerPushBP__DelegateSignature(FZeuzImageManagerPushPullOutput& Result, FString Error);              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullFileUrlBPS__DelegateSignature
	// void DelegateImagemanagerPullFileUrlBPS__DelegateSignature(FString Result);                                              // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullFileUrlBPF__DelegateSignature
	// void DelegateImagemanagerPullFileUrlBPF__DelegateSignature(FString Error);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullFileUrlBP__DelegateSignature
	// void DelegateImagemanagerPullFileUrlBP__DelegateSignature(FString Result, FString Error);                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullBPS__DelegateSignature
	// void DelegateImagemanagerPullBPS__DelegateSignature(FZeuzImageManagerPushPullOutput& Result);                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullBPF__DelegateSignature
	// void DelegateImagemanagerPullBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullBP__DelegateSignature
	// void DelegateImagemanagerPullBP__DelegateSignature(FZeuzImageManagerPushPullOutput& Result, FString Error);              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPublishBPS__DelegateSignature
	// void DelegateImagemanagerPublishBPS__DelegateSignature(FZeuzImagemanagerPublishState& Result);                           // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPublishBPF__DelegateSignature
	// void DelegateImagemanagerPublishBPF__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPublishBP__DelegateSignature
	// void DelegateImagemanagerPublishBP__DelegateSignature(FZeuzImagemanagerPublishState& Result, FString Error);             // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerListBPS__DelegateSignature
	// void DelegateImagemanagerListBPS__DelegateSignature(TArray<FZeuzImageManagerListEntry>& Result);                         // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerListBPF__DelegateSignature
	// void DelegateImagemanagerListBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerListBP__DelegateSignature
	// void DelegateImagemanagerListBP__DelegateSignature(TArray<FZeuzImageManagerListEntry>& Result, FString Error);           // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerGetpublishstateBPS__DelegateSignature
	// void DelegateImagemanagerGetpublishstateBPS__DelegateSignature(FZeuzImagemanagerPublishState& Result);                   // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerGetpublishstateBPF__DelegateSignature
	// void DelegateImagemanagerGetpublishstateBPF__DelegateSignature(FString Error);                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerGetpublishstateBP__DelegateSignature
	// void DelegateImagemanagerGetpublishstateBP__DelegateSignature(FZeuzImagemanagerPublishState& Result, FString Error);     // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerDiscardBPS__DelegateSignature
	// void DelegateImagemanagerDiscardBPS__DelegateSignature();                                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerDiscardBPF__DelegateSignature
	// void DelegateImagemanagerDiscardBPF__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerDiscardBP__DelegateSignature
	// void DelegateImagemanagerDiscardBP__DelegateSignature(FString Error);                                                    // [0x24710f0] Public|Delegate      
};

/// Class /Script/Zeuzsdk.ZeuzApiKVStore
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiKVStore : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.KVStorePutBP
	// void KVStorePutBP(FZeuzKVStorePutIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf5290] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.KVStoreGetBP
	// void KVStoreGetBP(FZeuzKVStoreKey& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf4f90] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.KVStoreDelBP
	// void KVStoreDelBP(FZeuzKVStoreDelIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf4c90] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.DelegateKVStorePutBPS__DelegateSignature
	// void DelegateKVStorePutBPS__DelegateSignature();                                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.DelegateKVStorePutBPF__DelegateSignature
	// void DelegateKVStorePutBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.DelegateKVStorePutBP__DelegateSignature
	// void DelegateKVStorePutBP__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreGetBPS__DelegateSignature
	// void DelegateKVStoreGetBPS__DelegateSignature(FZeuzKVStoreKVEntry& Result);                                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreGetBPF__DelegateSignature
	// void DelegateKVStoreGetBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreGetBP__DelegateSignature
	// void DelegateKVStoreGetBP__DelegateSignature(FZeuzKVStoreKVEntry& Result, FString Error);                                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreDelBPS__DelegateSignature
	// void DelegateKVStoreDelBPS__DelegateSignature();                                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreDelBPF__DelegateSignature
	// void DelegateKVStoreDelBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreDelBP__DelegateSignature
	// void DelegateKVStoreDelBP__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
};

/// Class /Script/Zeuzsdk.ZeuzApiLobby
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiLobby : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyUserBP
	// void LobbyUserBP(FZeuzLobbyUserIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf7250] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyUpdateBP
	// void LobbyUpdateBP(FZeuzLobbyStateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf6ee0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyStartBP
	// void LobbyStartBP(FZeuzLobbyStartDestroy& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf6be0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyRefreshBP
	// void LobbyRefreshBP(FZeuzLobbyRefresh& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf68d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyQueryBP
	// void LobbyQueryBP(FZeuzLobbyQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf6590] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyLeaveBP
	// void LobbyLeaveBP(FZeuzLobbyJoin& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf6270] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyKickBP
	// void LobbyKickBP(FZeuzLobbyKick& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf5f40] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyJoinBP
	// void LobbyJoinBP(FZeuzLobbyJoin& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf5c20] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyDestroyBP
	// void LobbyDestroyBP(FZeuzLobbyStartDestroy& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf5920] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.LobbyCreateBP
	// void LobbyCreateBP(FZeuzLobbyStateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf55b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyUserBPS__DelegateSignature
	// void DelegateLobbyUserBPS__DelegateSignature(FZeuzLobbyUsersOut& Result);                                                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyUserBPF__DelegateSignature
	// void DelegateLobbyUserBPF__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyUserBP__DelegateSignature
	// void DelegateLobbyUserBP__DelegateSignature(FZeuzLobbyUsersOut& Result, FString Error);                                  // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyUpdateBPS__DelegateSignature
	// void DelegateLobbyUpdateBPS__DelegateSignature(FZeuzLobbyUsersOut& Result);                                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyUpdateBPF__DelegateSignature
	// void DelegateLobbyUpdateBPF__DelegateSignature(FString Error);                                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyUpdateBP__DelegateSignature
	// void DelegateLobbyUpdateBP__DelegateSignature(FZeuzLobbyUsersOut& Result, FString Error);                                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyStartBPS__DelegateSignature
	// void DelegateLobbyStartBPS__DelegateSignature(FZeuzLobbyServerConnect& Result);                                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyStartBPF__DelegateSignature
	// void DelegateLobbyStartBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyStartBP__DelegateSignature
	// void DelegateLobbyStartBP__DelegateSignature(FZeuzLobbyServerConnect& Result, FString Error);                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyRefreshBPS__DelegateSignature
	// void DelegateLobbyRefreshBPS__DelegateSignature(FZeuzLobbyUsersOut& Result);                                             // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyRefreshBPF__DelegateSignature
	// void DelegateLobbyRefreshBPF__DelegateSignature(FString Error);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyRefreshBP__DelegateSignature
	// void DelegateLobbyRefreshBP__DelegateSignature(FZeuzLobbyUsersOut& Result, FString Error);                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyQueryBPS__DelegateSignature
	// void DelegateLobbyQueryBPS__DelegateSignature(FZeuzLobbyQueryOut& Result);                                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyQueryBPF__DelegateSignature
	// void DelegateLobbyQueryBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyQueryBP__DelegateSignature
	// void DelegateLobbyQueryBP__DelegateSignature(FZeuzLobbyQueryOut& Result, FString Error);                                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyLeaveBPS__DelegateSignature
	// void DelegateLobbyLeaveBPS__DelegateSignature();                                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyLeaveBPF__DelegateSignature
	// void DelegateLobbyLeaveBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyLeaveBP__DelegateSignature
	// void DelegateLobbyLeaveBP__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyKickBPS__DelegateSignature
	// void DelegateLobbyKickBPS__DelegateSignature();                                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyKickBPF__DelegateSignature
	// void DelegateLobbyKickBPF__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyKickBP__DelegateSignature
	// void DelegateLobbyKickBP__DelegateSignature(FString Error);                                                              // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyJoinBPS__DelegateSignature
	// void DelegateLobbyJoinBPS__DelegateSignature(FZeuzLobbyUsersOut& Result);                                                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyJoinBPF__DelegateSignature
	// void DelegateLobbyJoinBPF__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyJoinBP__DelegateSignature
	// void DelegateLobbyJoinBP__DelegateSignature(FZeuzLobbyUsersOut& Result, FString Error);                                  // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyDestroyBPS__DelegateSignature
	// void DelegateLobbyDestroyBPS__DelegateSignature();                                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyDestroyBPF__DelegateSignature
	// void DelegateLobbyDestroyBPF__DelegateSignature(FString Error);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyDestroyBP__DelegateSignature
	// void DelegateLobbyDestroyBP__DelegateSignature(FString Error);                                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyCreateBPS__DelegateSignature
	// void DelegateLobbyCreateBPS__DelegateSignature(FZeuzLobbyUsersOut& Result);                                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyCreateBPF__DelegateSignature
	// void DelegateLobbyCreateBPF__DelegateSignature(FString Error);                                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLobby.DelegateLobbyCreateBP__DelegateSignature
	// void DelegateLobbyCreateBP__DelegateSignature(FZeuzLobbyUsersOut& Result, FString Error);                                // [0x24710f0] Public|Delegate|HasOutParms 
};

/// Class /Script/Zeuzsdk.ZeuzApiLocality
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiLocality : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityRegionUpdateBP
	// void LocalityRegionUpdateBP(FZeuzRegion In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xafa4e0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityRegionRemoveBP
	// void LocalityRegionRemoveBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xafa1c0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityRegionGetBP
	// void LocalityRegionGetBP(FZeuzLocalityRegionGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf9e30] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityRegionCreateBP
	// void LocalityRegionCreateBP(FZeuzRegion In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf9760] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityProviderUpdateBP
	// void LocalityProviderUpdateBP(FZeuzProvider In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf9080] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityProviderRemoveBP
	// void LocalityProviderRemoveBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf8d60] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityProviderGetBP
	// void LocalityProviderGetBP(FZeuzLocalityProviderGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf8a10] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityProviderCreateBP
	// void LocalityProviderCreateBP(FZeuzProvider In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf8330] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityLocationUpdateBP
	// void LocalityLocationUpdateBP(FZeuzLocation In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf8020] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityLocationRemoveBP
	// void LocalityLocationRemoveBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf7d00] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityLocationGetBP
	// void LocalityLocationGetBP(FZeuzLocalityLocationGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf7920] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.LocalityLocationCreateBP
	// void LocalityLocationCreateBP(FZeuzLocation In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaf7610] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionUpdateBPS__DelegateSignature
	// void DelegateLocalityRegionUpdateBPS__DelegateSignature(FZeuzRegion Result);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionUpdateBPF__DelegateSignature
	// void DelegateLocalityRegionUpdateBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionUpdateBP__DelegateSignature
	// void DelegateLocalityRegionUpdateBP__DelegateSignature(FZeuzRegion Result, FString Error);                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionRemoveBPS__DelegateSignature
	// void DelegateLocalityRegionRemoveBPS__DelegateSignature();                                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionRemoveBPF__DelegateSignature
	// void DelegateLocalityRegionRemoveBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionRemoveBP__DelegateSignature
	// void DelegateLocalityRegionRemoveBP__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionGetBPS__DelegateSignature
	// void DelegateLocalityRegionGetBPS__DelegateSignature(TArray<FZeuzRegion>& Result);                                       // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionGetBPF__DelegateSignature
	// void DelegateLocalityRegionGetBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionGetBP__DelegateSignature
	// void DelegateLocalityRegionGetBP__DelegateSignature(TArray<FZeuzRegion>& Result, FString Error);                         // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionCreateBPS__DelegateSignature
	// void DelegateLocalityRegionCreateBPS__DelegateSignature(FZeuzRegion Result);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionCreateBPF__DelegateSignature
	// void DelegateLocalityRegionCreateBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionCreateBP__DelegateSignature
	// void DelegateLocalityRegionCreateBP__DelegateSignature(FZeuzRegion Result, FString Error);                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderUpdateBPS__DelegateSignature
	// void DelegateLocalityProviderUpdateBPS__DelegateSignature(FZeuzProvider Result);                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderUpdateBPF__DelegateSignature
	// void DelegateLocalityProviderUpdateBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderUpdateBP__DelegateSignature
	// void DelegateLocalityProviderUpdateBP__DelegateSignature(FZeuzProvider Result, FString Error);                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderRemoveBPS__DelegateSignature
	// void DelegateLocalityProviderRemoveBPS__DelegateSignature();                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderRemoveBPF__DelegateSignature
	// void DelegateLocalityProviderRemoveBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderRemoveBP__DelegateSignature
	// void DelegateLocalityProviderRemoveBP__DelegateSignature(FString Error);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderGetBPS__DelegateSignature
	// void DelegateLocalityProviderGetBPS__DelegateSignature(TArray<FZeuzProvider>& Result);                                   // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderGetBPF__DelegateSignature
	// void DelegateLocalityProviderGetBPF__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderGetBP__DelegateSignature
	// void DelegateLocalityProviderGetBP__DelegateSignature(TArray<FZeuzProvider>& Result, FString Error);                     // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderCreateBPS__DelegateSignature
	// void DelegateLocalityProviderCreateBPS__DelegateSignature(FZeuzProvider Result);                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderCreateBPF__DelegateSignature
	// void DelegateLocalityProviderCreateBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderCreateBP__DelegateSignature
	// void DelegateLocalityProviderCreateBP__DelegateSignature(FZeuzProvider Result, FString Error);                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationUpdateBPS__DelegateSignature
	// void DelegateLocalityLocationUpdateBPS__DelegateSignature(FZeuzLocation Result);                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationUpdateBPF__DelegateSignature
	// void DelegateLocalityLocationUpdateBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationUpdateBP__DelegateSignature
	// void DelegateLocalityLocationUpdateBP__DelegateSignature(FZeuzLocation Result, FString Error);                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationRemoveBPS__DelegateSignature
	// void DelegateLocalityLocationRemoveBPS__DelegateSignature();                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationRemoveBPF__DelegateSignature
	// void DelegateLocalityLocationRemoveBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationRemoveBP__DelegateSignature
	// void DelegateLocalityLocationRemoveBP__DelegateSignature(FString Error);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationGetBPS__DelegateSignature
	// void DelegateLocalityLocationGetBPS__DelegateSignature(TArray<FZeuzLocation>& Result);                                   // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationGetBPF__DelegateSignature
	// void DelegateLocalityLocationGetBPF__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationGetBP__DelegateSignature
	// void DelegateLocalityLocationGetBP__DelegateSignature(TArray<FZeuzLocation>& Result, FString Error);                     // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationCreateBPS__DelegateSignature
	// void DelegateLocalityLocationCreateBPS__DelegateSignature(FZeuzLocation Result);                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationCreateBPF__DelegateSignature
	// void DelegateLocalityLocationCreateBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationCreateBP__DelegateSignature
	// void DelegateLocalityLocationCreateBP__DelegateSignature(FZeuzLocation Result, FString Error);                           // [0x24710f0] Public|Delegate      
};

/// Class /Script/Zeuzsdk.ZeuzApiLogsearch
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiLogsearch : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.LogsearchStartexportBP
	// void LogsearchStartexportBP(FZeuzLogsearchAccountIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xafeac0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.LogsearchDownloadexportBP
	// void LogsearchDownloadexportBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xafe7a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.LogsearchCheckexportBP
	// void LogsearchCheckexportBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xafe480] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.LogsearchAccountBP
	// void LogsearchAccountBP(FZeuzLogsearchAccountIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xafe120] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchStartexportBPS__DelegateSignature
	// void DelegateLogsearchStartexportBPS__DelegateSignature(FString Result);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchStartexportBPF__DelegateSignature
	// void DelegateLogsearchStartexportBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchStartexportBP__DelegateSignature
	// void DelegateLogsearchStartexportBP__DelegateSignature(FString Result, FString Error);                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchDownloadexportBPS__DelegateSignature
	// void DelegateLogsearchDownloadexportBPS__DelegateSignature(FString Result);                                              // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchDownloadexportBPF__DelegateSignature
	// void DelegateLogsearchDownloadexportBPF__DelegateSignature(FString Error);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchDownloadexportBP__DelegateSignature
	// void DelegateLogsearchDownloadexportBP__DelegateSignature(FString Result, FString Error);                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchCheckexportBPS__DelegateSignature
	// void DelegateLogsearchCheckexportBPS__DelegateSignature(FZeuzLogsearchLogsStatus& Result);                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchCheckexportBPF__DelegateSignature
	// void DelegateLogsearchCheckexportBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchCheckexportBP__DelegateSignature
	// void DelegateLogsearchCheckexportBP__DelegateSignature(FZeuzLogsearchLogsStatus& Result, FString Error);                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchAccountBPS__DelegateSignature
	// void DelegateLogsearchAccountBPS__DelegateSignature(FZeuzLogsearchAccountOut& Result);                                   // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchAccountBPF__DelegateSignature
	// void DelegateLogsearchAccountBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchAccountBP__DelegateSignature
	// void DelegateLogsearchAccountBP__DelegateSignature(FZeuzLogsearchAccountOut& Result, FString Error);                     // [0x24710f0] Public|Delegate|HasOutParms 
};

/// Class /Script/Zeuzsdk.ZeuzApiMachine
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiMachine : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineUpdateresourceBP
	// void MachineUpdateresourceBP(FZeuzMachineResourceUpdateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb00ff0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineSettagsBP
	// void MachineSettagsBP(TArray<FZeuzMachineTagsSetIn>& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb00ca0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineResourcedeprovisionBP
	// void MachineResourcedeprovisionBP(FZeuzMachineResourceDeprovisionIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb00970] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineGettagsBP
	// void MachineGettagsBP(TArray<FString>& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb00660] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineGetresourcesBP
	// void MachineGetresourcesBP(FZeuzMachineResourceGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb00220] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineGetinfoBP
	// void MachineGetinfoBP(TArray<FString>& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xafff10] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineGetBP
	// void MachineGetBP(FZeuzMachineGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaffb70] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineDeallocateBP
	// void MachineDeallocateBP(FZeuzMachineResourceDeallocateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaff840] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineCountresourcesBP
	// void MachineCountresourcesBP(FZeuzMachineResourcesCountIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaff540] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineAllocateBP
	// void MachineAllocateBP(FZeuzMachineResourceAllocateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xaff210] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.MachineAddresourceBP
	// void MachineAddresourceBP(FZeuzMachineResourceDataIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xafee20] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineUpdateresourceBPS__DelegateSignature
	// void DelegateMachineUpdateresourceBPS__DelegateSignature(FZeuzMachineResourceInfo& Result);                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineUpdateresourceBPF__DelegateSignature
	// void DelegateMachineUpdateresourceBPF__DelegateSignature(FString Error);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineUpdateresourceBP__DelegateSignature
	// void DelegateMachineUpdateresourceBP__DelegateSignature(FZeuzMachineResourceInfo& Result, FString Error);                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineSettagsBPS__DelegateSignature
	// void DelegateMachineSettagsBPS__DelegateSignature(TArray<FZeuzMachineTagsSetIn>& Result);                                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineSettagsBPF__DelegateSignature
	// void DelegateMachineSettagsBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineSettagsBP__DelegateSignature
	// void DelegateMachineSettagsBP__DelegateSignature(TArray<FZeuzMachineTagsSetIn>& Result, FString Error);                  // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineResourcedeprovisionBPS__DelegateSignature
	// void DelegateMachineResourcedeprovisionBPS__DelegateSignature();                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineResourcedeprovisionBPF__DelegateSignature
	// void DelegateMachineResourcedeprovisionBPF__DelegateSignature(FString Error);                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineResourcedeprovisionBP__DelegateSignature
	// void DelegateMachineResourcedeprovisionBP__DelegateSignature(FString Error);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGettagsBPS__DelegateSignature
	// void DelegateMachineGettagsBPS__DelegateSignature(TArray<FZeuzMachineTagsSetIn>& Result);                                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGettagsBPF__DelegateSignature
	// void DelegateMachineGettagsBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGettagsBP__DelegateSignature
	// void DelegateMachineGettagsBP__DelegateSignature(TArray<FZeuzMachineTagsSetIn>& Result, FString Error);                  // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGetresourcesBPS__DelegateSignature
	// void DelegateMachineGetresourcesBPS__DelegateSignature(TArray<FZeuzMachineResourceInfo>& Result);                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGetresourcesBPF__DelegateSignature
	// void DelegateMachineGetresourcesBPF__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGetresourcesBP__DelegateSignature
	// void DelegateMachineGetresourcesBP__DelegateSignature(TArray<FZeuzMachineResourceInfo>& Result, FString Error);          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGetinfoBPS__DelegateSignature
	// void DelegateMachineGetinfoBPS__DelegateSignature(TArray<FZeuzMachineInfo>& Result);                                     // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGetinfoBPF__DelegateSignature
	// void DelegateMachineGetinfoBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGetinfoBP__DelegateSignature
	// void DelegateMachineGetinfoBP__DelegateSignature(TArray<FZeuzMachineInfo>& Result, FString Error);                       // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGetBPS__DelegateSignature
	// void DelegateMachineGetBPS__DelegateSignature(FZeuzMachineGetOut& Result);                                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGetBPF__DelegateSignature
	// void DelegateMachineGetBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineGetBP__DelegateSignature
	// void DelegateMachineGetBP__DelegateSignature(FZeuzMachineGetOut& Result, FString Error);                                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineDeallocateBPS__DelegateSignature
	// void DelegateMachineDeallocateBPS__DelegateSignature(TArray<FString>& Result);                                           // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineDeallocateBPF__DelegateSignature
	// void DelegateMachineDeallocateBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineDeallocateBP__DelegateSignature
	// void DelegateMachineDeallocateBP__DelegateSignature(TArray<FString>& Result, FString Error);                             // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineCountresourcesBPS__DelegateSignature
	// void DelegateMachineCountresourcesBPS__DelegateSignature(int32_t Result);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineCountresourcesBPF__DelegateSignature
	// void DelegateMachineCountresourcesBPF__DelegateSignature(FString Error);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineCountresourcesBP__DelegateSignature
	// void DelegateMachineCountresourcesBP__DelegateSignature(int32_t Result, FString Error);                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineAllocateBPS__DelegateSignature
	// void DelegateMachineAllocateBPS__DelegateSignature(TArray<FZeuzMachineInfo>& Result);                                    // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineAllocateBPF__DelegateSignature
	// void DelegateMachineAllocateBPF__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineAllocateBP__DelegateSignature
	// void DelegateMachineAllocateBP__DelegateSignature(TArray<FZeuzMachineInfo>& Result, FString Error);                      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineAddresourceBPS__DelegateSignature
	// void DelegateMachineAddresourceBPS__DelegateSignature(FZeuzMachineResourceInfo& Result);                                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineAddresourceBPF__DelegateSignature
	// void DelegateMachineAddresourceBPF__DelegateSignature(FString Error);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMachine.DelegateMachineAddresourceBP__DelegateSignature
	// void DelegateMachineAddresourceBP__DelegateSignature(FZeuzMachineResourceInfo& Result, FString Error);                   // [0x24710f0] Public|Delegate|HasOutParms 
};

/// Class /Script/Zeuzsdk.ZeuzApiMatchmaking
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiMatchmaking : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.MatchmakingUpdateBP
	// void MatchmakingUpdateBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb049a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.MatchmakingStatsBP
	// void MatchmakingStatsBP(FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb04720] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.MatchmakingServerrefreshBP
	// void MatchmakingServerrefreshBP(FZeuzMatchMakingServerInfo& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb04380] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.MatchmakingServerdestroyBP
	// void MatchmakingServerdestroyBP(FZeuzMatchMakingServerInfo& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb03fe0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.MatchmakingCreatepartyBP
	// void MatchmakingCreatepartyBP(FZeuzMatchMakingPartyInit& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb03b80] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.MatchmakingCreateBP
	// void MatchmakingCreateBP(FZeuzMatchMakingInit& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb037d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.MatchmakingCloseBP
	// void MatchmakingCloseBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb034b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingUpdateBPS__DelegateSignature
	// void DelegateMatchmakingUpdateBPS__DelegateSignature(FZeuzMatchMakingStatus& Result);                                    // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingUpdateBPF__DelegateSignature
	// void DelegateMatchmakingUpdateBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingUpdateBP__DelegateSignature
	// void DelegateMatchmakingUpdateBP__DelegateSignature(FZeuzMatchMakingStatus& Result, FString Error);                      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingStatsBPS__DelegateSignature
	// void DelegateMatchmakingStatsBPS__DelegateSignature(FZeuzMatchMakingStats& Result);                                      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingStatsBPF__DelegateSignature
	// void DelegateMatchmakingStatsBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingStatsBP__DelegateSignature
	// void DelegateMatchmakingStatsBP__DelegateSignature(FZeuzMatchMakingStats& Result, FString Error);                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerrefreshBPS__DelegateSignature
	// void DelegateMatchmakingServerrefreshBPS__DelegateSignature();                                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerrefreshBPF__DelegateSignature
	// void DelegateMatchmakingServerrefreshBPF__DelegateSignature(FString Error);                                              // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerrefreshBP__DelegateSignature
	// void DelegateMatchmakingServerrefreshBP__DelegateSignature(FString Error);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerdestroyBPS__DelegateSignature
	// void DelegateMatchmakingServerdestroyBPS__DelegateSignature();                                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerdestroyBPF__DelegateSignature
	// void DelegateMatchmakingServerdestroyBPF__DelegateSignature(FString Error);                                              // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerdestroyBP__DelegateSignature
	// void DelegateMatchmakingServerdestroyBP__DelegateSignature(FString Error);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreatepartyBPS__DelegateSignature
	// void DelegateMatchmakingCreatepartyBPS__DelegateSignature(FZeuzMatchMakingStatus& Result);                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreatepartyBPF__DelegateSignature
	// void DelegateMatchmakingCreatepartyBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreatepartyBP__DelegateSignature
	// void DelegateMatchmakingCreatepartyBP__DelegateSignature(FZeuzMatchMakingStatus& Result, FString Error);                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreateBPS__DelegateSignature
	// void DelegateMatchmakingCreateBPS__DelegateSignature(FZeuzMatchMakingStatus& Result);                                    // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreateBPF__DelegateSignature
	// void DelegateMatchmakingCreateBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreateBP__DelegateSignature
	// void DelegateMatchmakingCreateBP__DelegateSignature(FZeuzMatchMakingStatus& Result, FString Error);                      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCloseBPS__DelegateSignature
	// void DelegateMatchmakingCloseBPS__DelegateSignature();                                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCloseBPF__DelegateSignature
	// void DelegateMatchmakingCloseBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCloseBP__DelegateSignature
	// void DelegateMatchmakingCloseBP__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
};

/// Class /Script/Zeuzsdk.ZeuzApiMetrics
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiMetrics : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.MetricsPayloadnetworksentBP
	// void MetricsPayloadnetworksentBP(FZeuzMetricsQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb06a40] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.MetricsPayloadnetworkreceivedBP
	// void MetricsPayloadnetworkreceivedBP(FZeuzMetricsQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb06690] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.MetricsPayloadmemoryusageBP
	// void MetricsPayloadmemoryusageBP(FZeuzMetricsQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb062e0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.MetricsPayloadcpuusageBP
	// void MetricsPayloadcpuusageBP(FZeuzMetricsQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb05f30] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.MetricsPayloadcountBP
	// void MetricsPayloadcountBP(FZeuzMetricsQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb05b80] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.MetricsMachinenetworksentBP
	// void MetricsMachinenetworksentBP(FZeuzMetricsQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb057d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.MetricsMachinenetworkreceivedBP
	// void MetricsMachinenetworkreceivedBP(FZeuzMetricsQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb05420] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.MetricsMachinememoryusageBP
	// void MetricsMachinememoryusageBP(FZeuzMetricsQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb05070] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.MetricsMachinecpuusageBP
	// void MetricsMachinecpuusageBP(FZeuzMetricsQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb04cc0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworksentBPS__DelegateSignature
	// void DelegateMetricsPayloadnetworksentBPS__DelegateSignature(FZeuzVariant& Result);                                      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworksentBPF__DelegateSignature
	// void DelegateMetricsPayloadnetworksentBPF__DelegateSignature(FString Error);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworksentBP__DelegateSignature
	// void DelegateMetricsPayloadnetworksentBP__DelegateSignature(FZeuzVariant& Result, FString Error);                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworkreceivedBPS__DelegateSignature
	// void DelegateMetricsPayloadnetworkreceivedBPS__DelegateSignature(FZeuzVariant& Result);                                  // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworkreceivedBPF__DelegateSignature
	// void DelegateMetricsPayloadnetworkreceivedBPF__DelegateSignature(FString Error);                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworkreceivedBP__DelegateSignature
	// void DelegateMetricsPayloadnetworkreceivedBP__DelegateSignature(FZeuzVariant& Result, FString Error);                    // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadmemoryusageBPS__DelegateSignature
	// void DelegateMetricsPayloadmemoryusageBPS__DelegateSignature(FZeuzVariant& Result);                                      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadmemoryusageBPF__DelegateSignature
	// void DelegateMetricsPayloadmemoryusageBPF__DelegateSignature(FString Error);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadmemoryusageBP__DelegateSignature
	// void DelegateMetricsPayloadmemoryusageBP__DelegateSignature(FZeuzVariant& Result, FString Error);                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcpuusageBPS__DelegateSignature
	// void DelegateMetricsPayloadcpuusageBPS__DelegateSignature(FZeuzVariant& Result);                                         // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcpuusageBPF__DelegateSignature
	// void DelegateMetricsPayloadcpuusageBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcpuusageBP__DelegateSignature
	// void DelegateMetricsPayloadcpuusageBP__DelegateSignature(FZeuzVariant& Result, FString Error);                           // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcountBPS__DelegateSignature
	// void DelegateMetricsPayloadcountBPS__DelegateSignature(FZeuzVariant& Result);                                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcountBPF__DelegateSignature
	// void DelegateMetricsPayloadcountBPF__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcountBP__DelegateSignature
	// void DelegateMetricsPayloadcountBP__DelegateSignature(FZeuzVariant& Result, FString Error);                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworksentBPS__DelegateSignature
	// void DelegateMetricsMachinenetworksentBPS__DelegateSignature(FZeuzVariant& Result);                                      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworksentBPF__DelegateSignature
	// void DelegateMetricsMachinenetworksentBPF__DelegateSignature(FString Error);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworksentBP__DelegateSignature
	// void DelegateMetricsMachinenetworksentBP__DelegateSignature(FZeuzVariant& Result, FString Error);                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworkreceivedBPS__DelegateSignature
	// void DelegateMetricsMachinenetworkreceivedBPS__DelegateSignature(FZeuzVariant& Result);                                  // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworkreceivedBPF__DelegateSignature
	// void DelegateMetricsMachinenetworkreceivedBPF__DelegateSignature(FString Error);                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworkreceivedBP__DelegateSignature
	// void DelegateMetricsMachinenetworkreceivedBP__DelegateSignature(FZeuzVariant& Result, FString Error);                    // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinememoryusageBPS__DelegateSignature
	// void DelegateMetricsMachinememoryusageBPS__DelegateSignature(FZeuzVariant& Result);                                      // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinememoryusageBPF__DelegateSignature
	// void DelegateMetricsMachinememoryusageBPF__DelegateSignature(FString Error);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinememoryusageBP__DelegateSignature
	// void DelegateMetricsMachinememoryusageBP__DelegateSignature(FZeuzVariant& Result, FString Error);                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinecpuusageBPS__DelegateSignature
	// void DelegateMetricsMachinecpuusageBPS__DelegateSignature(FZeuzVariant& Result);                                         // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinecpuusageBPF__DelegateSignature
	// void DelegateMetricsMachinecpuusageBPF__DelegateSignature(FString Error);                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinecpuusageBP__DelegateSignature
	// void DelegateMetricsMachinecpuusageBP__DelegateSignature(FZeuzVariant& Result, FString Error);                           // [0x24710f0] Public|Delegate|HasOutParms 
};

/// Class /Script/Zeuzsdk.ZeuzApiPayload
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiPayload : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadUpdateBP
	// void PayloadUpdateBP(FZeuzPayloadUpdateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0e050] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadUnreserveBP
	// void PayloadUnreserveBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0dd30] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadStateupdateBP
	// void PayloadStateupdateBP(FZeuzPayloadStateGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0d9a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadStateinfoBP
	// void PayloadStateinfoBP(FZeuzPayloadStateGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0d610] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadResumeBP
	// void PayloadResumeBP(FZeuzPayloadResumeIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0d220] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadRestartBP
	// void PayloadRestartBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0cf00] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadReserveBP
	// void PayloadReserveBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0cbe0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadRemoveBP
	// void PayloadRemoveBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0c8c0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadGetBP
	// void PayloadGetBP(FZeuzPayloadGetIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0c4e0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadCreateBP
	// void PayloadCreateBP(FZeuzPayloadCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0c110] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.PayloadAllocateBP
	// void PayloadAllocateBP(FZeuzPayloadAllocateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0be00] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadUpdateBPS__DelegateSignature
	// void DelegatePayloadUpdateBPS__DelegateSignature(FZeuzPayloadInfo& Result);                                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadUpdateBPF__DelegateSignature
	// void DelegatePayloadUpdateBPF__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadUpdateBP__DelegateSignature
	// void DelegatePayloadUpdateBP__DelegateSignature(FZeuzPayloadInfo& Result, FString Error);                                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadUnreserveBPS__DelegateSignature
	// void DelegatePayloadUnreserveBPS__DelegateSignature(bool Result);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadUnreserveBPF__DelegateSignature
	// void DelegatePayloadUnreserveBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadUnreserveBP__DelegateSignature
	// void DelegatePayloadUnreserveBP__DelegateSignature(bool Result, FString Error);                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadStateupdateBPS__DelegateSignature
	// void DelegatePayloadStateupdateBPS__DelegateSignature(TArray<FZeuzPayloadStateInfo>& Result);                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadStateupdateBPF__DelegateSignature
	// void DelegatePayloadStateupdateBPF__DelegateSignature(FString Error);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadStateupdateBP__DelegateSignature
	// void DelegatePayloadStateupdateBP__DelegateSignature(TArray<FZeuzPayloadStateInfo>& Result, FString Error);              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadStateinfoBPS__DelegateSignature
	// void DelegatePayloadStateinfoBPS__DelegateSignature(TArray<FZeuzPayloadStateInfo>& Result);                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadStateinfoBPF__DelegateSignature
	// void DelegatePayloadStateinfoBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadStateinfoBP__DelegateSignature
	// void DelegatePayloadStateinfoBP__DelegateSignature(TArray<FZeuzPayloadStateInfo>& Result, FString Error);                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadResumeBPS__DelegateSignature
	// void DelegatePayloadResumeBPS__DelegateSignature(FZeuzPayloadInfo& Result);                                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadResumeBPF__DelegateSignature
	// void DelegatePayloadResumeBPF__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadResumeBP__DelegateSignature
	// void DelegatePayloadResumeBP__DelegateSignature(FZeuzPayloadInfo& Result, FString Error);                                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadRestartBPS__DelegateSignature
	// void DelegatePayloadRestartBPS__DelegateSignature(FZeuzPayloadInfo& Result);                                             // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadRestartBPF__DelegateSignature
	// void DelegatePayloadRestartBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadRestartBP__DelegateSignature
	// void DelegatePayloadRestartBP__DelegateSignature(FZeuzPayloadInfo& Result, FString Error);                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadReserveBPS__DelegateSignature
	// void DelegatePayloadReserveBPS__DelegateSignature(bool Result);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadReserveBPF__DelegateSignature
	// void DelegatePayloadReserveBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadReserveBP__DelegateSignature
	// void DelegatePayloadReserveBP__DelegateSignature(bool Result, FString Error);                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadRemoveBPS__DelegateSignature
	// void DelegatePayloadRemoveBPS__DelegateSignature();                                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadRemoveBPF__DelegateSignature
	// void DelegatePayloadRemoveBPF__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadRemoveBP__DelegateSignature
	// void DelegatePayloadRemoveBP__DelegateSignature(FString Error);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadGetBPS__DelegateSignature
	// void DelegatePayloadGetBPS__DelegateSignature(FZeuzPayloadGetOut& Result);                                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadGetBPF__DelegateSignature
	// void DelegatePayloadGetBPF__DelegateSignature(FString Error);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadGetBP__DelegateSignature
	// void DelegatePayloadGetBP__DelegateSignature(FZeuzPayloadGetOut& Result, FString Error);                                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadCreateBPS__DelegateSignature
	// void DelegatePayloadCreateBPS__DelegateSignature(FZeuzPayloadInfo& Result);                                              // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadCreateBPF__DelegateSignature
	// void DelegatePayloadCreateBPF__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadCreateBP__DelegateSignature
	// void DelegatePayloadCreateBP__DelegateSignature(FZeuzPayloadInfo& Result, FString Error);                                // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadAllocateBPS__DelegateSignature
	// void DelegatePayloadAllocateBPS__DelegateSignature(TArray<FZeuzPayloadInfo>& Result);                                    // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadAllocateBPF__DelegateSignature
	// void DelegatePayloadAllocateBPF__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPayload.DelegatePayloadAllocateBP__DelegateSignature
	// void DelegatePayloadAllocateBP__DelegateSignature(TArray<FZeuzPayloadInfo>& Result, FString Error);                      // [0x24710f0] Public|Delegate|HasOutParms 
};

/// Class /Script/Zeuzsdk.ZeuzApiProfile
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiProfile : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUserslookupBP
	// void ProfileUserslookupBP(TArray<FZeuzProfileUserLookupIn>& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb14210] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUserslistBP
	// void ProfileUserslistBP(FZeuzProfileUsersListIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb13f20] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUsersgetBP
	// void ProfileUsersgetBP(TArray<FString>& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb13c10] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUsersetpwhashBP
	// void ProfileUsersetpwhashBP(FZeuzProfileUserPwHashIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb13910] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUsersetBP
	// void ProfileUsersetBP(FZeuzUser In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb13110] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUserlookupBP
	// void ProfileUserlookupBP(FZeuzProfileUserLookupIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb12e10] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUsergetpwhashBP
	// void ProfileUsergetpwhashBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb12af0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUsergetBP
	// void ProfileUsergetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb127d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUserdeleteBP
	// void ProfileUserdeleteBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb124b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileUsercreateBP
	// void ProfileUsercreateBP(FZeuzProfileUserCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb12180] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileProfilesgetBP
	// void ProfileProfilesgetBP(TArray<FString>& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb11e70] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileProfilesetBP
	// void ProfileProfilesetBP(FZeuzUserProfile In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb11710] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileProfilegetBP
	// void ProfileProfilegetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb113f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileProfiledeleteBP
	// void ProfileProfiledeleteBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb110d0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemtransferBP
	// void ProfileItemtransferBP(FZeuzProfileItemTransferIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb10dc0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemsetBP
	// void ProfileItemsetBP(FZeuzInvItem In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb10680] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemrembynameBP
	// void ProfileItemrembynameBP(FZeuzProfileItemRemByNameIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb10370] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemremBP
	// void ProfileItemremBP(FZeuzProfileItemRemIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb10080] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemlistBP
	// void ProfileItemlistBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0fd60] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemgetbynameBP
	// void ProfileItemgetbynameBP(FZeuzProfileItemUserName& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0fa60] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemgetBP
	// void ProfileItemgetBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0f740] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemcreateBP
	// void ProfileItemcreateBP(FZeuzInvItem In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0f000] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemconfiggetBP
	// void ProfileItemconfiggetBP(FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0ed80] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItembuyBP
	// void ProfileItembuyBP(FZeuzProfileItemAddIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0ea70] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItembarterBP
	// void ProfileItembarterBP(FZeuzProfileItemBarterIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0e6f0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.ProfileItemaddBP
	// void ProfileItemaddBP(FZeuzProfileItemAddIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb0e3e0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserslookupBPS__DelegateSignature
	// void DelegateProfileUserslookupBPS__DelegateSignature(TArray<FString>& Result);                                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserslookupBPF__DelegateSignature
	// void DelegateProfileUserslookupBPF__DelegateSignature(FString Error);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserslookupBP__DelegateSignature
	// void DelegateProfileUserslookupBP__DelegateSignature(TArray<FString>& Result, FString Error);                            // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserslistBPS__DelegateSignature
	// void DelegateProfileUserslistBPS__DelegateSignature(FZeuzProfileUsersListOut& Result);                                   // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserslistBPF__DelegateSignature
	// void DelegateProfileUserslistBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserslistBP__DelegateSignature
	// void DelegateProfileUserslistBP__DelegateSignature(FZeuzProfileUsersListOut& Result, FString Error);                     // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsersgetBPS__DelegateSignature
	// void DelegateProfileUsersgetBPS__DelegateSignature(TArray<FZeuzUser>& Result);                                           // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsersgetBPF__DelegateSignature
	// void DelegateProfileUsersgetBPF__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsersgetBP__DelegateSignature
	// void DelegateProfileUsersgetBP__DelegateSignature(TArray<FZeuzUser>& Result, FString Error);                             // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsersetpwhashBPS__DelegateSignature
	// void DelegateProfileUsersetpwhashBPS__DelegateSignature();                                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsersetpwhashBPF__DelegateSignature
	// void DelegateProfileUsersetpwhashBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsersetpwhashBP__DelegateSignature
	// void DelegateProfileUsersetpwhashBP__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsersetBPS__DelegateSignature
	// void DelegateProfileUsersetBPS__DelegateSignature();                                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsersetBPF__DelegateSignature
	// void DelegateProfileUsersetBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsersetBP__DelegateSignature
	// void DelegateProfileUsersetBP__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserlookupBPS__DelegateSignature
	// void DelegateProfileUserlookupBPS__DelegateSignature(FString Result);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserlookupBPF__DelegateSignature
	// void DelegateProfileUserlookupBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserlookupBP__DelegateSignature
	// void DelegateProfileUserlookupBP__DelegateSignature(FString Result, FString Error);                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsergetpwhashBPS__DelegateSignature
	// void DelegateProfileUsergetpwhashBPS__DelegateSignature(FString Result);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsergetpwhashBPF__DelegateSignature
	// void DelegateProfileUsergetpwhashBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsergetpwhashBP__DelegateSignature
	// void DelegateProfileUsergetpwhashBP__DelegateSignature(FString Result, FString Error);                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsergetBPS__DelegateSignature
	// void DelegateProfileUsergetBPS__DelegateSignature(FZeuzUser Result);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsergetBPF__DelegateSignature
	// void DelegateProfileUsergetBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsergetBP__DelegateSignature
	// void DelegateProfileUsergetBP__DelegateSignature(FZeuzUser Result, FString Error);                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserdeleteBPS__DelegateSignature
	// void DelegateProfileUserdeleteBPS__DelegateSignature();                                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserdeleteBPF__DelegateSignature
	// void DelegateProfileUserdeleteBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUserdeleteBP__DelegateSignature
	// void DelegateProfileUserdeleteBP__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsercreateBPS__DelegateSignature
	// void DelegateProfileUsercreateBPS__DelegateSignature(FString Result);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsercreateBPF__DelegateSignature
	// void DelegateProfileUsercreateBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileUsercreateBP__DelegateSignature
	// void DelegateProfileUsercreateBP__DelegateSignature(FString Result, FString Error);                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfilesgetBPS__DelegateSignature
	// void DelegateProfileProfilesgetBPS__DelegateSignature(TArray<FZeuzUserProfile>& Result);                                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfilesgetBPF__DelegateSignature
	// void DelegateProfileProfilesgetBPF__DelegateSignature(FString Error);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfilesgetBP__DelegateSignature
	// void DelegateProfileProfilesgetBP__DelegateSignature(TArray<FZeuzUserProfile>& Result, FString Error);                   // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfilesetBPS__DelegateSignature
	// void DelegateProfileProfilesetBPS__DelegateSignature();                                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfilesetBPF__DelegateSignature
	// void DelegateProfileProfilesetBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfilesetBP__DelegateSignature
	// void DelegateProfileProfilesetBP__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfilegetBPS__DelegateSignature
	// void DelegateProfileProfilegetBPS__DelegateSignature(FZeuzUserProfile Result);                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfilegetBPF__DelegateSignature
	// void DelegateProfileProfilegetBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfilegetBP__DelegateSignature
	// void DelegateProfileProfilegetBP__DelegateSignature(FZeuzUserProfile Result, FString Error);                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfiledeleteBPS__DelegateSignature
	// void DelegateProfileProfiledeleteBPS__DelegateSignature();                                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfiledeleteBPF__DelegateSignature
	// void DelegateProfileProfiledeleteBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileProfiledeleteBP__DelegateSignature
	// void DelegateProfileProfiledeleteBP__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemtransferBPS__DelegateSignature
	// void DelegateProfileItemtransferBPS__DelegateSignature();                                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemtransferBPF__DelegateSignature
	// void DelegateProfileItemtransferBPF__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemtransferBP__DelegateSignature
	// void DelegateProfileItemtransferBP__DelegateSignature(FString Error);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemsetBPS__DelegateSignature
	// void DelegateProfileItemsetBPS__DelegateSignature();                                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemsetBPF__DelegateSignature
	// void DelegateProfileItemsetBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemsetBP__DelegateSignature
	// void DelegateProfileItemsetBP__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemrembynameBPS__DelegateSignature
	// void DelegateProfileItemrembynameBPS__DelegateSignature(FString Result);                                                 // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemrembynameBPF__DelegateSignature
	// void DelegateProfileItemrembynameBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemrembynameBP__DelegateSignature
	// void DelegateProfileItemrembynameBP__DelegateSignature(FString Result, FString Error);                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemremBPS__DelegateSignature
	// void DelegateProfileItemremBPS__DelegateSignature();                                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemremBPF__DelegateSignature
	// void DelegateProfileItemremBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemremBP__DelegateSignature
	// void DelegateProfileItemremBP__DelegateSignature(FString Error);                                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemlistBPS__DelegateSignature
	// void DelegateProfileItemlistBPS__DelegateSignature(TArray<FZeuzInvItem>& Result);                                        // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemlistBPF__DelegateSignature
	// void DelegateProfileItemlistBPF__DelegateSignature(FString Error);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemlistBP__DelegateSignature
	// void DelegateProfileItemlistBP__DelegateSignature(TArray<FZeuzInvItem>& Result, FString Error);                          // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemgetbynameBPS__DelegateSignature
	// void DelegateProfileItemgetbynameBPS__DelegateSignature(FZeuzInvItem Result);                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemgetbynameBPF__DelegateSignature
	// void DelegateProfileItemgetbynameBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemgetbynameBP__DelegateSignature
	// void DelegateProfileItemgetbynameBP__DelegateSignature(FZeuzInvItem Result, FString Error);                              // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemgetBPS__DelegateSignature
	// void DelegateProfileItemgetBPS__DelegateSignature(FZeuzInvItem Result);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemgetBPF__DelegateSignature
	// void DelegateProfileItemgetBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemgetBP__DelegateSignature
	// void DelegateProfileItemgetBP__DelegateSignature(FZeuzInvItem Result, FString Error);                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemcreateBPS__DelegateSignature
	// void DelegateProfileItemcreateBPS__DelegateSignature(FString Result);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemcreateBPF__DelegateSignature
	// void DelegateProfileItemcreateBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemcreateBP__DelegateSignature
	// void DelegateProfileItemcreateBP__DelegateSignature(FString Result, FString Error);                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemconfiggetBPS__DelegateSignature
	// void DelegateProfileItemconfiggetBPS__DelegateSignature(FZeuzProfileItemConfigGetOut& Result);                           // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemconfiggetBPF__DelegateSignature
	// void DelegateProfileItemconfiggetBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemconfiggetBP__DelegateSignature
	// void DelegateProfileItemconfiggetBP__DelegateSignature(FZeuzProfileItemConfigGetOut& Result, FString Error);             // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItembuyBPS__DelegateSignature
	// void DelegateProfileItembuyBPS__DelegateSignature(FString Result);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItembuyBPF__DelegateSignature
	// void DelegateProfileItembuyBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItembuyBP__DelegateSignature
	// void DelegateProfileItembuyBP__DelegateSignature(FString Result, FString Error);                                         // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItembarterBPS__DelegateSignature
	// void DelegateProfileItembarterBPS__DelegateSignature();                                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItembarterBPF__DelegateSignature
	// void DelegateProfileItembarterBPF__DelegateSignature(FString Error);                                                     // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItembarterBP__DelegateSignature
	// void DelegateProfileItembarterBP__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemaddBPS__DelegateSignature
	// void DelegateProfileItemaddBPS__DelegateSignature(FString Result);                                                       // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemaddBPF__DelegateSignature
	// void DelegateProfileItemaddBPF__DelegateSignature(FString Error);                                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiProfile.DelegateProfileItemaddBP__DelegateSignature
	// void DelegateProfileItemaddBP__DelegateSignature(FString Result, FString Error);                                         // [0x24710f0] Public|Delegate      
};

/// Class /Script/Zeuzsdk.ZeuzApiServerbrowser
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiServerbrowser : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.ServerbrowserRefreshBP
	// void ServerbrowserRefreshBP(FZeuzServerBrowserStateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb17990] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.ServerbrowserQueryBP
	// void ServerbrowserQueryBP(FZeuzServerBrowserQueryIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb17650] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.ServerbrowserDestroyBP
	// void ServerbrowserDestroyBP(FString In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb17330] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.DelegateServerbrowserRefreshBPS__DelegateSignature
	// void DelegateServerbrowserRefreshBPS__DelegateSignature();                                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.DelegateServerbrowserRefreshBPF__DelegateSignature
	// void DelegateServerbrowserRefreshBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.DelegateServerbrowserRefreshBP__DelegateSignature
	// void DelegateServerbrowserRefreshBP__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.DelegateServerbrowserQueryBPS__DelegateSignature
	// void DelegateServerbrowserQueryBPS__DelegateSignature(FZeuzServerBrowserQueryOut& Result);                               // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.DelegateServerbrowserQueryBPF__DelegateSignature
	// void DelegateServerbrowserQueryBPF__DelegateSignature(FString Error);                                                    // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.DelegateServerbrowserQueryBP__DelegateSignature
	// void DelegateServerbrowserQueryBP__DelegateSignature(FZeuzServerBrowserQueryOut& Result, FString Error);                 // [0x24710f0] Public|Delegate|HasOutParms 
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.DelegateServerbrowserDestroyBPS__DelegateSignature
	// void DelegateServerbrowserDestroyBPS__DelegateSignature();                                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.DelegateServerbrowserDestroyBPF__DelegateSignature
	// void DelegateServerbrowserDestroyBPF__DelegateSignature(FString Error);                                                  // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiServerbrowser.DelegateServerbrowserDestroyBP__DelegateSignature
	// void DelegateServerbrowserDestroyBP__DelegateSignature(FString Error);                                                   // [0x24710f0] Public|Delegate      
};

/// Class /Script/Zeuzsdk.ZeuzApiSimpleAuth
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiSimpleAuth : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.StringHash
	// FString StringHash(FString Val);                                                                                         // [0xb18160] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.SimpleProfileUsercreateBP
	// void SimpleProfileUsercreateBP(FZeuzSimpleProfileUserCreateIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb17e30] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.DelegateSimpleProfileUsercreateBPS__DelegateSignature
	// void DelegateSimpleProfileUsercreateBPS__DelegateSignature(FString Result);                                              // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.DelegateSimpleProfileUsercreateBPF__DelegateSignature
	// void DelegateSimpleProfileUsercreateBPF__DelegateSignature(FString Error);                                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.DelegateSimpleProfileUsercreateBP__DelegateSignature
	// void DelegateSimpleProfileUsercreateBP__DelegateSignature(FString Result, FString Error);                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.DelegateAuthLoginBPS__DelegateSignature
	// void DelegateAuthLoginBPS__DelegateSignature(FZeuzContext Context);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.DelegateAuthLoginBPF__DelegateSignature
	// void DelegateAuthLoginBPF__DelegateSignature(FString Error);                                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.DelegateAuthLoginBP__DelegateSignature
	// void DelegateAuthLoginBP__DelegateSignature(FZeuzContext Context, FString Error);                                        // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.DelegateAuthCheckSessionBPS__DelegateSignature
	// void DelegateAuthCheckSessionBPS__DelegateSignature(FZeuzTimestamp Expires);                                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.DelegateAuthCheckSessionBPF__DelegateSignature
	// void DelegateAuthCheckSessionBPF__DelegateSignature(FString Error);                                                      // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.DelegateAuthCheckSessionBP__DelegateSignature
	// void DelegateAuthCheckSessionBP__DelegateSignature(FZeuzTimestamp Expires, FString Error);                               // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.CalcPWHash
	// FString CalcPWHash(FString Login, FString Password);                                                                     // [0xb167c0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.AuthLoginBP
	// void AuthLoginBP(FZeuzSimpleAuthLoginIn& In, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx, bool SaveDefaultContext); // [0xb16460] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiSimpleAuth.AuthCheckSessionBP
	// void AuthCheckSessionBP(FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext Ctx); // [0xb16160] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/Zeuzsdk.ZeuzApiContext
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiContext : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiContext.SetDefaultContext
	// void SetDefaultContext(FZeuzContext& Ctx);                                                                               // [0xb17ce0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiContext.GetDefaultContext
	// FZeuzContext GetDefaultContext();                                                                                        // [0xb16ce0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/Zeuzsdk.ZeuzID
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzID : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzID.IsValid
	// bool IsValid(FString ID);                                                                                                // [0xb17220] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzID.IsType
	// bool IsType(FString ID, ZeuzIDType typ);                                                                                 // [0xb170d0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzID.GetType
	// ZeuzIDType GetType(FString ID);                                                                                          // [0xb16fe0] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/Zeuzsdk.ZeuzApiPing
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiPing : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiPing.DoPingBP
	// void DoPingBP(FString Target, float Timeout, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb16970] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPing.DelegateDoPingBPS__DelegateSignature
	// void DelegateDoPingBPS__DelegateSignature(FString Target, float Duration, FString Resolved);                             // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPing.DelegateDoPingBPF__DelegateSignature
	// void DelegateDoPingBPF__DelegateSignature(FString Error);                                                                // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPing.DelegateDoPingBP__DelegateSignature
	// void DelegateDoPingBP__DelegateSignature(FString Target, float Duration, FString Resolved, FString Error);               // [0x24710f0] Public|Delegate      
};

/// Class /Script/Zeuzsdk.ZeuzApiPubIP
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiPubIP : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiPubIP.GetPublicIPBP
	// void GetPublicIPBP(bool v6, FDelegateProperty& Callback, FDelegateProperty& OnSuccess, FDelegateProperty& OnFailure, FZeuzContext& Ctx); // [0xb16d10] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiPubIP.DelegateGetPublicIPBPS__DelegateSignature
	// void DelegateGetPublicIPBPS__DelegateSignature(FString Result);                                                          // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPubIP.DelegateGetPublicIPBPF__DelegateSignature
	// void DelegateGetPublicIPBPF__DelegateSignature(FString Error);                                                           // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiPubIP.DelegateGetPublicIPBP__DelegateSignature
	// void DelegateGetPublicIPBP__DelegateSignature(FString Result, FString Error);                                            // [0x24710f0] Public|Delegate      
};

/// Class /Script/Zeuzsdk.ZeuzTagsUtil
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzTagsUtil : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzTagsUtil.TagsToString
	// FString TagsToString(FZeuzTags& In);                                                                                     // [0xb1a3b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzTagsUtil.StringToTags
	// void StringToTags(FString In, FZeuzTags& Out);                                                                           // [0xb19b90] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
};

/// Class /Script/Zeuzsdk.ZeuzApiTime
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiTime : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiTime.ToDateTime
	// FDateTime ToDateTime(FZeuzTimestamp T);                                                                                  // [0xb1a640] Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiTime.Now
	// FZeuzTimestamp Now(bool adjusted);                                                                                       // [0xb19620] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiTime.IsZero
	// bool IsZero(FZeuzTimestamp T);                                                                                           // [0xb192e0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiTime.GetOffset
	// FZeuzTimestamp GetOffset();                                                                                              // [0xb19170] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiTime.FromDateTime
	// FZeuzTimestamp FromDateTime(FDateTime T, bool adjusted);                                                                 // [0xb190b0] Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiTime.AdjustOffset
	// void AdjustOffset(FZeuzTimestamp ofs);                                                                                   // [0xb19030] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/Zeuzsdk.ZeuzApiUtil
/// Size: 0x0000 (0 bytes) (0x000028 - 0x000028) align 8 pad: 0x0000
class UZeuzApiUtil : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/Zeuzsdk.ZeuzApiUtil.TimerWithString
	// void TimerWithString(FDelegateProperty& Event, float Time, FString Value);                                               // [0xb1a4c0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.TimerDynamicDelegateS__DelegateSignature
	// void TimerDynamicDelegateS__DelegateSignature(FString Value);                                                            // [0x24710f0] Public|Delegate      
	// Function /Script/Zeuzsdk.ZeuzApiUtil.StructToVariant
	// bool StructToVariant(class UProperty* AnyStruct, FZeuzVariant& Value);                                                   // [0xb1a270] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.StructToByteArrayJSON
	// bool StructToByteArrayJSON(class UProperty* AnyStruct, FZeuzByteArray& Value);                                           // [0xb1a150] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.StructToByteArrayBin
	// bool StructToByteArrayBin(class UProperty* AnyStruct, FZeuzByteArray& Value);                                            // [0xb1a030] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.StructFromVariant
	// bool StructFromVariant(class UProperty*& AnyStruct, FZeuzVariant& Value);                                                // [0xb19ef0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.StructFromByteArrayJSON
	// bool StructFromByteArrayJSON(class UProperty*& AnyStruct, FZeuzByteArray& Value);                                        // [0xb19dd0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.StructFromByteArrayBin
	// bool StructFromByteArrayBin(class UProperty* AnyStruct, FZeuzByteArray& Value);                                          // [0xb19cb0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.StringNotEmpty
	// bool StringNotEmpty(FString String);                                                                                     // [0xb19a80] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.StringIsEmpty
	// bool StringIsEmpty(FString String);                                                                                      // [0xb19970] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.SaveGameToByteArray
	// bool SaveGameToByteArray(FString Filename, FZeuzByteArray& Value);                                                       // [0xb19810] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.SaveGameFromByteArray
	// bool SaveGameFromByteArray(FZeuzByteArray& Value, FString Filename);                                                     // [0xb196b0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.JsonToVariant
	// bool JsonToVariant(FString Json, FZeuzVariant& Variant);                                                                 // [0xb194a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.JsonFromVariant
	// bool JsonFromVariant(FZeuzVariant& Variant, FString& Json);                                                              // [0xb19370] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Zeuzsdk.ZeuzApiUtil.GetSaveGamePath
	// FString GetSaveGamePath(FString Name);                                                                                   // [0xb191b0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
};

/// Struct /Script/Zeuzsdk.ZeuzVariant
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzVariant
{ 
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzByteArray
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzByteArray
{ 
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzContext
/// Size: 0x0098 (152 bytes) (0x000000 - 0x000098) align 8 pad: 0x0000
struct FZeuzContext
{ 
	FString                                            Endpoint;                                                   // 0x0000   (0x0010)  
	FString                                            SessionID;                                                  // 0x0010   (0x0010)  
	FString                                            SessionKey;                                                 // 0x0020   (0x0010)  
	FString                                            UserID;                                                     // 0x0030   (0x0010)  
	FString                                            DeveloperID;                                                // 0x0040   (0x0010)  
	FString                                            ProjID;                                                     // 0x0050   (0x0010)  
	FString                                            EnvID;                                                      // 0x0060   (0x0010)  
	FString                                            Login;                                                      // 0x0070   (0x0010)  
	FString                                            PWHash;                                                     // 0x0080   (0x0010)  
	EZeuzSessionType                                   LoginType;                                                  // 0x0090   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0091   (0x0007)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzACLEntry
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzACLEntry
{ 
	FString                                            GenID;                                                      // 0x0000   (0x0010)  
	int32_t                                            Grant;                                                      // 0x0010   (0x0004)  
	int32_t                                            Deny;                                                       // 0x0014   (0x0004)  
};

/// Struct /Script/Zeuzsdk.ZeuzACL
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzACL
{ 
	TArray<FZeuzACLEntry>                              List;                                                       // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzTags
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzTags
{ 
	TArray<FString>                                    Tags;                                                       // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProperties
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FZeuzProperties
{ 
	int32_t                                            Version;                                                    // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FZeuzTags                                          Tags;                                                       // 0x0008   (0x0010)  
	FZeuzVariant                                       Val;                                                        // 0x0018   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzTimestamp
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 pad: 0x0000
struct FZeuzTimestamp
{ 
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzItemCommon
/// Size: 0x0088 (136 bytes) (0x000000 - 0x000088) align 8 pad: 0x0000
struct FZeuzItemCommon
{ 
	int32_t                                            Version;                                                    // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FString                                            Title;                                                      // 0x0008   (0x0010)  
	FZeuzACL                                           ACL;                                                        // 0x0018   (0x0010)  
	FZeuzProperties                                    Props;                                                      // 0x0028   (0x0028)  
	FZeuzTimestamp                                     Created;                                                    // 0x0050   (0x0008)  
	FString                                            CreatedBy;                                                  // 0x0058   (0x0010)  
	FZeuzTimestamp                                     Modified;                                                   // 0x0068   (0x0008)  
	FString                                            ModifiedBy;                                                 // 0x0070   (0x0010)  
	FZeuzTimestamp                                     Expires;                                                    // 0x0080   (0x0008)  
};

/// Struct /Script/Zeuzsdk.ZeuzProvisioningAccount
/// Size: 0x00C0 (192 bytes) (0x000000 - 0x0000C0) align 8 pad: 0x0000
struct FZeuzProvisioningAccount
{ 
	FString                                            ProviderID;                                                 // 0x0000   (0x0010)  
	bool                                               SpawnInstances;                                             // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0011   (0x0007)  MISSED
	FString                                            Username;                                                   // 0x0018   (0x0010)  
	FString                                            Password;                                                   // 0x0028   (0x0010)  
	FString                                            ApiKey;                                                     // 0x0038   (0x0010)  
	FString                                            SecretKey;                                                  // 0x0048   (0x0010)  
	FString                                            SubscriptionID;                                             // 0x0058   (0x0010)  
	FString                                            TenantID;                                                   // 0x0068   (0x0010)  
	FString                                            ClientId;                                                   // 0x0078   (0x0010)  
	FString                                            ClientSecret;                                               // 0x0088   (0x0010)  
	FString                                            GcpCredentialsFile;                                         // 0x0098   (0x0010)  
	FString                                            GcpFileName;                                                // 0x00A8   (0x0010)  
	FZeuzTimestamp                                     GcpUploadFileDate;                                          // 0x00B8   (0x0008)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccount
/// Size: 0x00E0 (224 bytes) (0x000088 - 0x000168) align 8 pad: 0x0000
struct FZeuzAccount : FZeuzItemCommon
{ 
	FString                                            ID;                                                         // 0x0088   (0x0010)  
	TArray<FString>                                    Managers;                                                   // 0x0098   (0x0010)  
	TArray<FString>                                    Projects;                                                   // 0x00A8   (0x0010)  
	TArray<FString>                                    Teams;                                                      // 0x00B8   (0x0010)  
	TArray<FString>                                    Devs;                                                       // 0x00C8   (0x0010)  
	FString                                            Desc;                                                       // 0x00D8   (0x0010)  
	FString                                            EMail;                                                      // 0x00E8   (0x0010)  
	FString                                            Company;                                                    // 0x00F8   (0x0010)  
	FString                                            Department;                                                 // 0x0108   (0x0010)  
	FString                                            Country;                                                    // 0x0118   (0x0010)  
	FString                                            ZIP;                                                        // 0x0128   (0x0010)  
	FString                                            City;                                                       // 0x0138   (0x0010)  
	FString                                            StreetAddr;                                                 // 0x0148   (0x0010)  
	TArray<FZeuzProvisioningAccount>                   ProvisioningAccounts;                                       // 0x0158   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminAccountsIn
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 pad: 0x0000
struct FZeuzAdminAccountsIn
{ 
	unsigned char                                      UnknownData00_2[0x1];                                       // 0x0000   (0x0001)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAdminCountResoucesIn
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzAdminCountResoucesIn
{ 
	bool                                               OnlyInUse;                                                  // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FString                                            RegionID;                                                   // 0x0008   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminCountResoucesPerAccountOut
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FZeuzAdminCountResoucesPerAccountOut
{ 
	FString                                            AccountID;                                                  // 0x0000   (0x0010)  
	FString                                            AccountName;                                                // 0x0010   (0x0010)  
	int32_t                                            Count;                                                      // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAdminTestpoolIn
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzAdminTestpoolIn
{ 
	FString                                            RegionID;                                                   // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzDeveloper
/// Size: 0x0098 (152 bytes) (0x000088 - 0x000120) align 8 pad: 0x0000
struct FZeuzDeveloper : FZeuzItemCommon
{ 
	FString                                            ID;                                                         // 0x0088   (0x0010)  
	FString                                            Account;                                                    // 0x0098   (0x0010)  
	int32_t                                            Role;                                                       // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00AC   (0x0004)  MISSED
	FString                                            Login;                                                      // 0x00B0   (0x0010)  
	FString                                            Desc;                                                       // 0x00C0   (0x0010)  
	FString                                            PWHash;                                                     // 0x00D0   (0x0010)  
	FZeuzTimestamp                                     LastLogin;                                                  // 0x00E0   (0x0008)  
	TArray<FString>                                    Projects;                                                   // 0x00E8   (0x0010)  
	TArray<FString>                                    Teams;                                                      // 0x00F8   (0x0010)  
	bool                                               Revoked;                                                    // 0x0108   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0109   (0x0007)  MISSED
	FZeuzTimestamp                                     RevokedAt;                                                  // 0x0110   (0x0008)  
	FZeuzTimestamp                                     PasswordRequestExpiry;                                      // 0x0118   (0x0008)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminAccountIn
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzAdminAccountIn
{ 
	FString                                            AccountID;                                                  // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzServiceCfg
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 pad: 0x0000
struct FZeuzServiceCfg
{ 
	FString                                            ServiceType;                                                // 0x0000   (0x0010)  
	int32_t                                            MaxScale;                                                   // 0x0010   (0x0004)  
	int32_t                                            CurScale;                                                   // 0x0014   (0x0004)  
	int32_t                                            CloudScale;                                                 // 0x0018   (0x0004)  
	int32_t                                            Busy;                                                       // 0x001C   (0x0004)  
	int32_t                                            Idle;                                                       // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
	FString                                            Params;                                                     // 0x0028   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzEnv
/// Size: 0x0060 (96 bytes) (0x000088 - 0x0000E8) align 8 pad: 0x0000
struct FZeuzEnv : FZeuzItemCommon
{ 
	FString                                            ID;                                                         // 0x0088   (0x0010)  
	FString                                            Proj;                                                       // 0x0098   (0x0010)  
	FString                                            Account;                                                    // 0x00A8   (0x0010)  
	bool                                               Enabled;                                                    // 0x00B8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00B9   (0x0007)  MISSED
	FString                                            Desc;                                                       // 0x00C0   (0x0010)  
	int32_t                                            MaxScale;                                                   // 0x00D0   (0x0004)  
	int32_t                                            CurScale;                                                   // 0x00D4   (0x0004)  
	TArray<FZeuzServiceCfg>                            Services;                                                   // 0x00D8   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminEnvIn
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzAdminEnvIn
{ 
	FString                                            ProjectID;                                                  // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminItem
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzAdminItem
{ 
	FString                                            ID;                                                         // 0x0000   (0x0010)  
	FString                                            Name;                                                       // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminItemsOut
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzAdminItemsOut
{ 
	TArray<FZeuzAdminItem>                             Items;                                                      // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminItemsIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzAdminItemsIn
{ 
	FString                                            Table;                                                      // 0x0000   (0x0010)  
	FString                                            Query;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzLogsearchOut
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzLogsearchOut
{ 
	FZeuzVariant                                       Stats;                                                      // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminLogsIn
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FZeuzAdminLogsIn
{ 
	FString                                            Start;                                                      // 0x0000   (0x0010)  
	FString                                            End;                                                        // 0x0010   (0x0010)  
	FString                                            Account;                                                    // 0x0020   (0x0010)  
	FString                                            Project;                                                    // 0x0030   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProjEnvInfo
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzProjEnvInfo
{ 
	FString                                            ID;                                                         // 0x0000   (0x0010)  
	FString                                            Title;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProj
/// Size: 0x0040 (64 bytes) (0x000088 - 0x0000C8) align 8 pad: 0x0000
struct FZeuzProj : FZeuzItemCommon
{ 
	FString                                            ID;                                                         // 0x0088   (0x0010)  
	FString                                            Account;                                                    // 0x0098   (0x0010)  
	FString                                            Desc;                                                       // 0x00A8   (0x0010)  
	TArray<FZeuzProjEnvInfo>                           Envs;                                                       // 0x00B8   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminStat
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzAdminStat
{ 
	FString                                            GroupCol;                                                   // 0x0000   (0x0010)  
	int32_t                                            CountVal;                                                   // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAdminStatsOut
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzAdminStatsOut
{ 
	TArray<FZeuzAdminStat>                             Stats;                                                      // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAdminStatsIn
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 pad: 0x0000
struct FZeuzAdminStatsIn
{ 
	FString                                            Table;                                                      // 0x0000   (0x0010)  
	FString                                            Start;                                                      // 0x0010   (0x0010)  
	FString                                            End;                                                        // 0x0020   (0x0010)  
	FString                                            GroupBy;                                                    // 0x0030   (0x0010)  
	FString                                            Count;                                                      // 0x0040   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzSession
/// Size: 0x0068 (104 bytes) (0x000088 - 0x0000F0) align 8 pad: 0x0000
struct FZeuzSession : FZeuzItemCommon
{ 
	FString                                            ID;                                                         // 0x0088   (0x0010)  
	FString                                            SessionKey;                                                 // 0x0098   (0x0010)  
	FString                                            Dev;                                                        // 0x00A8   (0x0010)  
	FString                                            User;                                                       // 0x00B8   (0x0010)  
	FString                                            ApiKey;                                                     // 0x00C8   (0x0010)  
	FString                                            Proj;                                                       // 0x00D8   (0x0010)  
	bool                                               Admin;                                                      // 0x00E8   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x00E9   (0x0007)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAuthLoginResult
/// Size: 0x0068 (104 bytes) (0x000000 - 0x000068) align 8 pad: 0x0000
struct FZeuzAuthLoginResult
{ 
	FString                                            Dev;                                                        // 0x0000   (0x0010)  
	FString                                            User;                                                       // 0x0010   (0x0010)  
	FString                                            ApiKey;                                                     // 0x0020   (0x0010)  
	FString                                            Proj;                                                       // 0x0030   (0x0010)  
	FString                                            SessionID;                                                  // 0x0040   (0x0010)  
	FString                                            SessionNonce;                                               // 0x0050   (0x0010)  
	FZeuzTimestamp                                     ValidThru;                                                  // 0x0060   (0x0008)  
};

/// Struct /Script/Zeuzsdk.ZeuzAuthLoginIn
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FZeuzAuthLoginIn
{ 
	FString                                            Login;                                                      // 0x0000   (0x0010)  
	bool                                               IsUser;                                                     // 0x0010   (0x0001)  
	bool                                               IsApi;                                                      // 0x0011   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0012   (0x0006)  MISSED
	FZeuzTimestamp                                     Time;                                                       // 0x0018   (0x0008)  
	FString                                            Nonce;                                                      // 0x0020   (0x0010)  
	FString                                            Hash;                                                       // 0x0030   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAPIKey
/// Size: 0x0058 (88 bytes) (0x000088 - 0x0000E0) align 8 pad: 0x0000
struct FZeuzAPIKey : FZeuzItemCommon
{ 
	FString                                            APIKeyID;                                                   // 0x0088   (0x0010)  
	FString                                            Key;                                                        // 0x0098   (0x0010)  
	FString                                            ProjID;                                                     // 0x00A8   (0x0010)  
	FString                                            PWHash;                                                     // 0x00B8   (0x0010)  
	bool                                               Revoked;                                                    // 0x00C8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00C9   (0x0007)  MISSED
	FZeuzTimestamp                                     RevokedAt;                                                  // 0x00D0   (0x0008)  
	FZeuzTimestamp                                     LastLogin;                                                  // 0x00D8   (0x0008)  
};

/// Struct /Script/Zeuzsdk.ZeuzAPIKeyDeleteIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzAPIKeyDeleteIn
{ 
	FString                                            APIKeyID;                                                   // 0x0000   (0x0010)  
	FString                                            ProjID;                                                     // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAPIKeyGenerateIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzAPIKeyGenerateIn
{ 
	FString                                            ProjID;                                                     // 0x0000   (0x0010)  
	FString                                            Title;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAPIKeyGetIn
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FZeuzAPIKeyGetIn
{ 
	FString                                            APIKeyID;                                                   // 0x0000   (0x0010)  
	FString                                            ProjID;                                                     // 0x0010   (0x0010)  
	bool                                               NotRevoked;                                                 // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAPIKeyPwHashIn
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 pad: 0x0000
struct FZeuzAPIKeyPwHashIn
{ 
	FString                                            APIKeyID;                                                   // 0x0000   (0x0010)  
	FString                                            ProjID;                                                     // 0x0010   (0x0010)  
	FString                                            PWHash;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemClassConfig
/// Size: 0x0070 (112 bytes) (0x000000 - 0x000070) align 8 pad: 0x0000
struct FZeuzProfileItemClassConfig
{ 
	FString                                            Name;                                                       // 0x0000   (0x0010)  
	int32_t                                            CountMaxU;                                                  // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FZeuzTimestamp                                     LimitAddInterval;                                           // 0x0018   (0x0008)  
	SDK_UNDEFINED(80,605) /* TMap<FString, FString> */ __um(Params);                                               // 0x0020   (0x0050)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemNameCount
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzProfileItemNameCount
{ 
	FString                                            Name;                                                       // 0x0000   (0x0010)  
	int32_t                                            Count;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemConfig
/// Size: 0x0090 (144 bytes) (0x000000 - 0x000090) align 8 pad: 0x0000
struct FZeuzProfileItemConfig
{ 
	FString                                            Name;                                                       // 0x0000   (0x0010)  
	FString                                            Class;                                                      // 0x0010   (0x0010)  
	int32_t                                            CountMaxU;                                                  // 0x0020   (0x0004)  
	bool                                               Stackable;                                                  // 0x0024   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0025   (0x0003)  MISSED
	FZeuzTimestamp                                     LimitAddInterval;                                           // 0x0028   (0x0008)  
	SDK_UNDEFINED(80,606) /* TMap<FString, FString> */ __um(Params);                                               // 0x0030   (0x0050)  
	TArray<FZeuzProfileItemNameCount>                  BuyPrice;                                                   // 0x0080   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemConfigGetOut
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzProfileItemConfigGetOut
{ 
	TArray<FZeuzProfileItemClassConfig>                Classes;                                                    // 0x0000   (0x0010)  
	TArray<FZeuzProfileItemConfig>                     Items;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzInvItem
/// Size: 0x0038 (56 bytes) (0x000088 - 0x0000C0) align 8 pad: 0x0000
struct FZeuzInvItem : FZeuzItemCommon
{ 
	FString                                            ID;                                                         // 0x0088   (0x0010)  
	FString                                            UserID;                                                     // 0x0098   (0x0010)  
	FString                                            Name;                                                       // 0x00A8   (0x0010)  
	int32_t                                            Count;                                                      // 0x00B8   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x00BC   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzUserProfile
/// Size: 0x0088 (136 bytes) (0x000000 - 0x000088) align 8 pad: 0x0000
struct FZeuzUserProfile
{ 
	FString                                            ID;                                                         // 0x0000   (0x0010)  
	FZeuzTags                                          Tags;                                                       // 0x0010   (0x0010)  
	FZeuzTimestamp                                     FirstLogin;                                                 // 0x0020   (0x0008)  
	FZeuzTimestamp                                     BanStart;                                                   // 0x0028   (0x0008)  
	FZeuzTimestamp                                     BanEnd;                                                     // 0x0030   (0x0008)  
	TArray<FString>                                    Comments;                                                   // 0x0038   (0x0010)  
	FZeuzVariant                                       Data;                                                       // 0x0048   (0x0010)  
	TArray<FString>                                    LinkedAccounts;                                             // 0x0058   (0x0010)  
	TArray<FString>                                    Friends;                                                    // 0x0068   (0x0010)  
	TArray<FString>                                    Blocked;                                                    // 0x0078   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzUser
/// Size: 0x0050 (80 bytes) (0x000088 - 0x0000D8) align 8 pad: 0x0000
struct FZeuzUser : FZeuzItemCommon
{ 
	FString                                            ID;                                                         // 0x0088   (0x0010)  
	FString                                            Login;                                                      // 0x0098   (0x0010)  
	FString                                            Name;                                                       // 0x00A8   (0x0010)  
	FString                                            PWHash;                                                     // 0x00B8   (0x0010)  
	FString                                            Desc;                                                       // 0x00C8   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileUsersListOut
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzProfileUsersListOut
{ 
	int32_t                                            Count;                                                      // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	TArray<FString>                                    UserIDs;                                                    // 0x0008   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemAddIn
/// Size: 0x0010 (16 bytes) (0x000018 - 0x000028) align 8 pad: 0x0000
struct FZeuzProfileItemAddIn : FZeuzProfileItemNameCount
{ 
	FString                                            UserID;                                                     // 0x0018   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemMove
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzProfileItemMove
{ 
	FString                                            ID;                                                         // 0x0000   (0x0010)  
	int32_t                                            Count;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemBarterIn
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FZeuzProfileItemBarterIn
{ 
	FString                                            UserIDA;                                                    // 0x0000   (0x0010)  
	FString                                            UserIDB;                                                    // 0x0010   (0x0010)  
	TArray<FZeuzProfileItemMove>                       OfferA;                                                     // 0x0020   (0x0010)  
	TArray<FZeuzProfileItemMove>                       OfferB;                                                     // 0x0030   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemUserName
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzProfileItemUserName
{ 
	FString                                            UserID;                                                     // 0x0000   (0x0010)  
	FString                                            Name;                                                       // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemRemIn
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzProfileItemRemIn
{ 
	FString                                            ItemID;                                                     // 0x0000   (0x0010)  
	int32_t                                            Count;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemRemByNameIn
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FZeuzProfileItemRemByNameIn
{ 
	FString                                            UserID;                                                     // 0x0000   (0x0010)  
	FString                                            Name;                                                       // 0x0010   (0x0010)  
	int32_t                                            Count;                                                      // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzProfileItemTransferIn
/// Size: 0x0010 (16 bytes) (0x000018 - 0x000028) align 8 pad: 0x0000
struct FZeuzProfileItemTransferIn : FZeuzProfileItemMove
{ 
	FString                                            UserIDTo;                                                   // 0x0018   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileUserCreateIn
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FZeuzProfileUserCreateIn
{ 
	FString                                            Login;                                                      // 0x0000   (0x0010)  
	FString                                            Name;                                                       // 0x0010   (0x0010)  
	FString                                            Desc;                                                       // 0x0020   (0x0010)  
	FString                                            PWHash;                                                     // 0x0030   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileUserLookupIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzProfileUserLookupIn
{ 
	FString                                            Login;                                                      // 0x0000   (0x0010)  
	FString                                            Name;                                                       // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileUserPwHashIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzProfileUserPwHashIn
{ 
	FString                                            UserID;                                                     // 0x0000   (0x0010)  
	FString                                            PWHash;                                                     // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzProfileUsersListIn
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzProfileUsersListIn
{ 
	FString                                            Offset;                                                     // 0x0000   (0x0010)  
	int32_t                                            Count;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAccountCreateIn
/// Size: 0x00C8 (200 bytes) (0x000000 - 0x0000C8) align 8 pad: 0x0000
struct FZeuzAccountCreateIn
{ 
	FString                                            Title;                                                      // 0x0000   (0x0010)  
	FString                                            Desc;                                                       // 0x0010   (0x0010)  
	FString                                            EMail;                                                      // 0x0020   (0x0010)  
	FString                                            Company;                                                    // 0x0030   (0x0010)  
	FString                                            Department;                                                 // 0x0040   (0x0010)  
	FString                                            Country;                                                    // 0x0050   (0x0010)  
	FString                                            ZIP;                                                        // 0x0060   (0x0010)  
	FString                                            City;                                                       // 0x0070   (0x0010)  
	FString                                            StreetAddr;                                                 // 0x0080   (0x0010)  
	FZeuzProperties                                    Props;                                                      // 0x0090   (0x0028)  
	TArray<FZeuzProvisioningAccount>                   ProvisioningAccounts;                                       // 0x00B8   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountDeveloperCreateIn
/// Size: 0x0080 (128 bytes) (0x000000 - 0x000080) align 8 pad: 0x0000
struct FZeuzAccountDeveloperCreateIn
{ 
	FString                                            Login;                                                      // 0x0000   (0x0010)  
	FString                                            Title;                                                      // 0x0010   (0x0010)  
	FString                                            Desc;                                                       // 0x0020   (0x0010)  
	FString                                            AccountID;                                                  // 0x0030   (0x0010)  
	int32_t                                            AccountRole;                                                // 0x0040   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0044   (0x0004)  MISSED
	FString                                            PWHash;                                                     // 0x0048   (0x0010)  
	FZeuzProperties                                    Props;                                                      // 0x0058   (0x0028)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountDeveloperCreatePwHashIn
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FZeuzAccountDeveloperCreatePwHashIn
{ 
	FString                                            DevID;                                                      // 0x0000   (0x0010)  
	FString                                            AccountID;                                                  // 0x0010   (0x0010)  
	FString                                            Hash;                                                       // 0x0020   (0x0010)  
	FString                                            PWHash;                                                     // 0x0030   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountDeveloperPasswordResetExecuteRequestIn
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FZeuzAccountDeveloperPasswordResetExecuteRequestIn
{ 
	FString                                            EMail;                                                      // 0x0000   (0x0010)  
	FString                                            Hash;                                                       // 0x0010   (0x0010)  
	FString                                            PasswordHash;                                               // 0x0020   (0x0010)  
	FString                                            PasswordConfirmHash;                                        // 0x0030   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountDeveloperPasswordResetIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzAccountDeveloperPasswordResetIn
{ 
	FString                                            EMail;                                                      // 0x0000   (0x0010)  
	FString                                            Token;                                                      // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountDeveloperSetPwHashIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzAccountDeveloperSetPwHashIn
{ 
	FString                                            CurrentPWHash;                                              // 0x0000   (0x0010)  
	FString                                            NewPWHash;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountDevQuickSetupOut
/// Size: 0x0080 (128 bytes) (0x000000 - 0x000080) align 8 pad: 0x0000
struct FZeuzAccountDevQuickSetupOut
{ 
	FString                                            Login;                                                      // 0x0000   (0x0010)  
	FString                                            Account;                                                    // 0x0010   (0x0010)  
	FString                                            User;                                                       // 0x0020   (0x0010)  
	FString                                            Dev;                                                        // 0x0030   (0x0010)  
	FString                                            Team;                                                       // 0x0040   (0x0010)  
	FString                                            Proj;                                                       // 0x0050   (0x0010)  
	FString                                            Env;                                                        // 0x0060   (0x0010)  
	FString                                            ApiKey;                                                     // 0x0070   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountDevQuickSetupIn
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 pad: 0x0000
struct FZeuzAccountDevQuickSetupIn
{ 
	FString                                            Login;                                                      // 0x0000   (0x0010)  
	FString                                            Title;                                                      // 0x0010   (0x0010)  
	FString                                            PWHash;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountEnvCreateIn
/// Size: 0x0058 (88 bytes) (0x000000 - 0x000058) align 8 pad: 0x0000
struct FZeuzAccountEnvCreateIn
{ 
	FString                                            Proj;                                                       // 0x0000   (0x0010)  
	FString                                            Title;                                                      // 0x0010   (0x0010)  
	FString                                            Desc;                                                       // 0x0020   (0x0010)  
	FZeuzProperties                                    Props;                                                      // 0x0030   (0x0028)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountEnvDeleteIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzAccountEnvDeleteIn
{ 
	FString                                            Proj;                                                       // 0x0000   (0x0010)  
	FString                                            Env;                                                        // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountChange
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzAccountChange
{ 
	FString                                            Account;                                                    // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountProjectCreateIn
/// Size: 0x0048 (72 bytes) (0x000010 - 0x000058) align 8 pad: 0x0000
struct FZeuzAccountProjectCreateIn : FZeuzAccountChange
{ 
	FString                                            Title;                                                      // 0x0010   (0x0010)  
	FString                                            Desc;                                                       // 0x0020   (0x0010)  
	FZeuzProperties                                    Props;                                                      // 0x0030   (0x0028)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountProjectDeleteIn
/// Size: 0x0010 (16 bytes) (0x000010 - 0x000020) align 8 pad: 0x0000
struct FZeuzAccountProjectDeleteIn : FZeuzAccountChange
{ 
	FString                                            Proj;                                                       // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountQuotaInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzAccountQuotaInfo
{ 
	FString                                            Account;                                                    // 0x0000   (0x0010)  
	int32_t                                            QuotaCL;                                                    // 0x0010   (0x0004)  
	int32_t                                            QuotaBM;                                                    // 0x0014   (0x0004)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountTeamCreateIn
/// Size: 0x0058 (88 bytes) (0x000010 - 0x000068) align 8 pad: 0x0000
struct FZeuzAccountTeamCreateIn : FZeuzAccountChange
{ 
	FString                                            Title;                                                      // 0x0010   (0x0010)  
	FString                                            Desc;                                                       // 0x0020   (0x0010)  
	FZeuzProperties                                    Props;                                                      // 0x0030   (0x0028)  
	TArray<FString>                                    Devs;                                                       // 0x0058   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAccountTeamDeleteIn
/// Size: 0x0010 (16 bytes) (0x000010 - 0x000020) align 8 pad: 0x0000
struct FZeuzAccountTeamDeleteIn : FZeuzAccountChange
{ 
	FString                                            Team;                                                       // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzTeam
/// Size: 0x0040 (64 bytes) (0x000088 - 0x0000C8) align 8 pad: 0x0000
struct FZeuzTeam : FZeuzItemCommon
{ 
	FString                                            ID;                                                         // 0x0088   (0x0010)  
	FString                                            Account;                                                    // 0x0098   (0x0010)  
	FString                                            Desc;                                                       // 0x00A8   (0x0010)  
	TArray<FString>                                    Devs;                                                       // 0x00B8   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineSpec
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FZeuzMachineSpec
{ 
	FString                                            OS;                                                         // 0x0000   (0x0010)  
	int32_t                                            CoreCount;                                                  // 0x0010   (0x0004)  
	int32_t                                            CoreMhz;                                                    // 0x0014   (0x0004)  
	int32_t                                            MemoryMB;                                                   // 0x0018   (0x0004)  
	int32_t                                            StorageGB;                                                  // 0x001C   (0x0004)  
	int32_t                                            IOBandwidthMBps;                                            // 0x0020   (0x0004)  
	int32_t                                            InetBandwidthMBps;                                          // 0x0024   (0x0004)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineResourceInfo
/// Size: 0x00F0 (240 bytes) (0x000000 - 0x0000F0) align 8 pad: 0x0000
struct FZeuzMachineResourceInfo
{ 
	FString                                            ResourceID;                                                 // 0x0000   (0x0010)  
	FString                                            LocationID;                                                 // 0x0010   (0x0010)  
	FZeuzMachineSpec                                   Spec;                                                       // 0x0020   (0x0028)  
	FString                                            Provider;                                                   // 0x0048   (0x0010)  
	FString                                            Hostname;                                                   // 0x0058   (0x0010)  
	FString                                            IP;                                                         // 0x0068   (0x0010)  
	bool                                               IgnoreOnAlloc;                                              // 0x0078   (0x0001)  
	bool                                               Bound;                                                      // 0x0079   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x007A   (0x0006)  MISSED
	FString                                            MachineID;                                                  // 0x0080   (0x0010)  
	FString                                            AccountID;                                                  // 0x0090   (0x0010)  
	int32_t                                            TierLevel;                                                  // 0x00A0   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00A4   (0x0004)  MISSED
	FZeuzTags                                          Tags;                                                       // 0x00A8   (0x0010)  
	FString                                            ProvisionJobID;                                             // 0x00B8   (0x0010)  
	FString                                            ResourceClusterID;                                          // 0x00C8   (0x0010)  
	FString                                            NodeID;                                                     // 0x00D8   (0x0010)  
	bool                                               AllocatingDisabled;                                         // 0x00E8   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x00E9   (0x0007)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzMachineInfo
/// Size: 0x00C8 (200 bytes) (0x000000 - 0x0000C8) align 8 pad: 0x0000
struct FZeuzMachineInfo
{ 
	FString                                            MachineID;                                                  // 0x0000   (0x0010)  
	FString                                            ResourceID;                                                 // 0x0010   (0x0010)  
	FString                                            LocationID;                                                 // 0x0020   (0x0010)  
	FString                                            AllocationID;                                               // 0x0030   (0x0010)  
	FString                                            AccountID;                                                  // 0x0040   (0x0010)  
	FZeuzMachineSpec                                   Spec;                                                       // 0x0050   (0x0028)  
	FZeuzTags                                          Tags;                                                       // 0x0078   (0x0010)  
	FString                                            IP;                                                         // 0x0088   (0x0010)  
	TArray<FString>                                    Regions;                                                    // 0x0098   (0x0010)  
	FString                                            LocationType;                                               // 0x00A8   (0x0010)  
	FZeuzTimestamp                                     Created;                                                    // 0x00B8   (0x0008)  
	FZeuzTimestamp                                     Finished;                                                   // 0x00C0   (0x0008)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineGetOut
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzMachineGetOut
{ 
	TArray<FZeuzMachineInfo>                           Items;                                                      // 0x0000   (0x0010)  
	int32_t                                            Count;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzMachineTagsSetIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzMachineTagsSetIn
{ 
	FString                                            ID;                                                         // 0x0000   (0x0010)  
	FZeuzTags                                          Tags;                                                       // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineResourceDataIn
/// Size: 0x00C0 (192 bytes) (0x000000 - 0x0000C0) align 8 pad: 0x0000
struct FZeuzMachineResourceDataIn
{ 
	FString                                            LocationID;                                                 // 0x0000   (0x0010)  
	FZeuzMachineSpec                                   Spec;                                                       // 0x0010   (0x0028)  
	FString                                            Hostname;                                                   // 0x0038   (0x0010)  
	FString                                            Provider;                                                   // 0x0048   (0x0010)  
	FString                                            IP;                                                         // 0x0058   (0x0010)  
	bool                                               IgnoreOnAlloc;                                              // 0x0068   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0069   (0x0007)  MISSED
	FString                                            AccountID;                                                  // 0x0070   (0x0010)  
	int32_t                                            TierLevel;                                                  // 0x0080   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0084   (0x0004)  MISSED
	FZeuzTags                                          Tags;                                                       // 0x0088   (0x0010)  
	FString                                            ResourceClusterID;                                          // 0x0098   (0x0010)  
	FString                                            NodeID;                                                     // 0x00A8   (0x0010)  
	bool                                               AllocatingDisabled;                                         // 0x00B8   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x00B9   (0x0007)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzMachineResourceAllocateIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzMachineResourceAllocateIn
{ 
	FString                                            AllocationID;                                               // 0x0000   (0x0010)  
	TArray<FString>                                    Resources;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineResourcesCountIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzMachineResourcesCountIn
{ 
	FString                                            AccountID;                                                  // 0x0000   (0x0010)  
	FString                                            Type;                                                       // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineResourceDeallocateIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzMachineResourceDeallocateIn
{ 
	FString                                            AllocationID;                                               // 0x0000   (0x0010)  
	TArray<FString>                                    Machines;                                                   // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachinePagination
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FZeuzMachinePagination
{ 
	bool                                               GetTotal;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Offset;                                                     // 0x0004   (0x0004)  
	int32_t                                            Limit;                                                      // 0x0008   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            OrderBy;                                                    // 0x0010   (0x0010)  
	bool                                               OrderAsc;                                                   // 0x0020   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzMachineGetIn
/// Size: 0x0060 (96 bytes) (0x000028 - 0x000088) align 8 pad: 0x0000
struct FZeuzMachineGetIn : FZeuzMachinePagination
{ 
	FString                                            MachineID;                                                  // 0x0028   (0x0010)  
	FString                                            AllocationID;                                               // 0x0038   (0x0010)  
	FString                                            RegionID;                                                   // 0x0048   (0x0010)  
	FString                                            LocationType;                                               // 0x0058   (0x0010)  
	TArray<FString>                                    Tags;                                                       // 0x0068   (0x0010)  
	FZeuzTimestamp                                     Start;                                                      // 0x0078   (0x0008)  
	FZeuzTimestamp                                     End;                                                        // 0x0080   (0x0008)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineResourceGetIn
/// Size: 0x0090 (144 bytes) (0x000000 - 0x000090) align 8 pad: 0x0000
struct FZeuzMachineResourceGetIn
{ 
	TArray<FString>                                    ResourceIDs;                                                // 0x0000   (0x0010)  
	FString                                            RegionID;                                                   // 0x0010   (0x0010)  
	FZeuzMachineSpec                                   MinSpec;                                                    // 0x0020   (0x0028)  
	TArray<FString>                                    MachineType;                                                // 0x0048   (0x0010)  
	TArray<FString>                                    Accounts;                                                   // 0x0058   (0x0010)  
	TArray<FString>                                    Machines;                                                   // 0x0068   (0x0010)  
	TArray<FString>                                    Providers;                                                  // 0x0078   (0x0010)  
	int32_t                                            MinTierLevel;                                               // 0x0088   (0x0004)  
	bool                                               GetBound;                                                   // 0x008C   (0x0001)  
	bool                                               GetUnbound;                                                 // 0x008D   (0x0001)  
	bool                                               ForAllocation;                                              // 0x008E   (0x0001)  
	bool                                               ForDeprovisioning;                                          // 0x008F   (0x0001)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineResourceDeprovisionIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzMachineResourceDeprovisionIn
{ 
	FString                                            AllocationID;                                               // 0x0000   (0x0010)  
	TArray<FString>                                    Resources;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineResourceUpdateIn
/// Size: 0x00D0 (208 bytes) (0x000000 - 0x0000D0) align 8 pad: 0x0000
struct FZeuzMachineResourceUpdateIn
{ 
	FString                                            ResourceID;                                                 // 0x0000   (0x0010)  
	FZeuzMachineResourceDataIn                         Data;                                                       // 0x0010   (0x00C0)  
};

/// Struct /Script/Zeuzsdk.ZeuzMetricsEvalCondition
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 4 pad: 0x0000
struct FZeuzMetricsEvalCondition
{ 
	int32_t                                            TimeFrame;                                                  // 0x0000   (0x0004)  
	float                                              CoreUsageThreshold;                                         // 0x0004   (0x0004)  
	float                                              MemoryUsageThreshold;                                       // 0x0008   (0x0004)  
	float                                              IOBandwidthThreshold;                                       // 0x000C   (0x0004)  
	float                                              InetBandwidthThreshold;                                     // 0x0010   (0x0004)  
};

/// Struct /Script/Zeuzsdk.ZeuzProviderResourceTypes
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzProviderResourceTypes
{ 
	FString                                            Provider;                                                   // 0x0000   (0x0010)  
	TArray<FString>                                    ResourceTypes;                                              // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzMachineScalingRules
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 pad: 0x0000
struct FZeuzMachineScalingRules
{ 
	bool                                               EnableScaling;                                              // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            MaxCloudMachines;                                           // 0x0004   (0x0004)  
	bool                                               UseAllBareMetalMachines;                                    // 0x0008   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	int32_t                                            MaxBareMetalMachines;                                       // 0x000C   (0x0004)  
	int32_t                                            MinFreePayloadCapacity;                                     // 0x0010   (0x0004)  
	int32_t                                            MaxFreePayloadCapacity;                                     // 0x0014   (0x0004)  
	bool                                               UseMetrics;                                                 // 0x0018   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0019   (0x0003)  MISSED
	int32_t                                            CapEvalTimeFrame;                                           // 0x001C   (0x0004)  
	TArray<FZeuzMetricsEvalCondition>                  BlockedConditions;                                          // 0x0020   (0x0010)  
	TArray<FZeuzMetricsEvalCondition>                  IdleConditions;                                             // 0x0030   (0x0010)  
	TArray<FZeuzProviderResourceTypes>                 AllowedResourceTypes;                                       // 0x0040   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzPortDef
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzPortDef
{ 
	FString                                            Name;                                                       // 0x0000   (0x0010)  
	int32_t                                            Port;                                                       // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzPayloadDef
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FZeuzPayloadDef
{ 
	FString                                            HostOS;                                                     // 0x0000   (0x0010)  
	FString                                            Image;                                                      // 0x0010   (0x0010)  
	TArray<FString>                                    Cmd;                                                        // 0x0020   (0x0010)  
	TArray<FZeuzPortDef>                               Ports;                                                      // 0x0030   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzPayloadQuota
/// Size: 0x0014 (20 bytes) (0x000000 - 0x000014) align 4 pad: 0x0000
struct FZeuzPayloadQuota
{ 
	float                                              CpuCores;                                                   // 0x0000   (0x0004)  
	int32_t                                            MemoryMB;                                                   // 0x0004   (0x0004)  
	int32_t                                            StorageGB;                                                  // 0x0008   (0x0004)  
	int32_t                                            IOBandwidthMBps;                                            // 0x000C   (0x0004)  
	int32_t                                            InetBandwidthMBps;                                          // 0x0010   (0x0004)  
};

/// Struct /Script/Zeuzsdk.ZeuzSafetyLimits
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 4 pad: 0x0000
struct FZeuzSafetyLimits
{ 
	float                                              CoreMaxUsageThreshold;                                      // 0x0000   (0x0004)  
	int32_t                                            CpuRemainingCores;                                          // 0x0004   (0x0004)  
	int32_t                                            MemoryMBFree;                                               // 0x0008   (0x0004)  
	int32_t                                            StorageGBFree;                                              // 0x000C   (0x0004)  
	int32_t                                            IOMBpsFree;                                                 // 0x0010   (0x0004)  
	int32_t                                            InetMBpsFree;                                               // 0x0014   (0x0004)  
};

/// Struct /Script/Zeuzsdk.ZeuzPayloadScalingRules
/// Size: 0x0080 (128 bytes) (0x000000 - 0x000080) align 8 pad: 0x0000
struct FZeuzPayloadScalingRules
{ 
	bool                                               EnableScaling;                                              // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	FZeuzPayloadDef                                    PayloadDef;                                                 // 0x0008   (0x0040)  
	FZeuzPayloadQuota                                  PayloadQuota;                                               // 0x0048   (0x0014)  
	FZeuzSafetyLimits                                  SafetyLimits;                                               // 0x005C   (0x0018)  
	int32_t                                            MinUnreservedPayloads;                                      // 0x0074   (0x0004)  
	int32_t                                            MaxUnreservedPayloads;                                      // 0x0078   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x007C   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzScalingRules
/// Size: 0x00D0 (208 bytes) (0x000000 - 0x0000D0) align 8 pad: 0x0000
struct FZeuzScalingRules
{ 
	FZeuzMachineScalingRules                           Machine;                                                    // 0x0000   (0x0050)  
	FZeuzPayloadScalingRules                           Payload;                                                    // 0x0050   (0x0080)  
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationInfo
/// Size: 0x0168 (360 bytes) (0x000000 - 0x000168) align 8 pad: 0x0000
struct FZeuzAllocationInfo
{ 
	FString                                            AllocationID;                                               // 0x0000   (0x0010)  
	FString                                            ProjID;                                                     // 0x0010   (0x0010)  
	FString                                            EnvID;                                                      // 0x0020   (0x0010)  
	TArray<FString>                                    Regions;                                                    // 0x0030   (0x0010)  
	TArray<FString>                                    Machines;                                                   // 0x0040   (0x0010)  
	FString                                            Description;                                                // 0x0050   (0x0010)  
	bool                                               Enabled;                                                    // 0x0060   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0061   (0x0007)  MISSED
	FZeuzScalingRules                                  ScalingRules;                                               // 0x0068   (0x00D0)  
	FZeuzMachineSpec                                   MachineMinSpec;                                             // 0x0138   (0x0028)  
	int32_t                                            ActivePayloads;                                             // 0x0160   (0x0004)  
	int32_t                                            ReservedPayloads;                                           // 0x0164   (0x0004)  
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationDef
/// Size: 0x0118 (280 bytes) (0x000000 - 0x000118) align 8 pad: 0x0000
struct FZeuzAllocationDef
{ 
	FString                                            Description;                                                // 0x0000   (0x0010)  
	TArray<FString>                                    Regions;                                                    // 0x0010   (0x0010)  
	FZeuzScalingRules                                  ScalingRules;                                               // 0x0020   (0x00D0)  
	FZeuzMachineSpec                                   MachineMinSpec;                                             // 0x00F0   (0x0028)  
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationCreateIn
/// Size: 0x0138 (312 bytes) (0x000000 - 0x000138) align 8 pad: 0x0000
struct FZeuzAllocationCreateIn
{ 
	FString                                            ProjID;                                                     // 0x0000   (0x0010)  
	FString                                            EnvID;                                                      // 0x0010   (0x0010)  
	FZeuzAllocationDef                                 AllocationDef;                                              // 0x0020   (0x0118)  
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationGetOut
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzAllocationGetOut
{ 
	TArray<FZeuzAllocationInfo>                        Items;                                                      // 0x0000   (0x0010)  
	int32_t                                            Count;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationPagination
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FZeuzAllocationPagination
{ 
	bool                                               GetTotal;                                                   // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Offset;                                                     // 0x0004   (0x0004)  
	int32_t                                            Limit;                                                      // 0x0008   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	FString                                            OrderBy;                                                    // 0x0010   (0x0010)  
	bool                                               OrderAsc;                                                   // 0x0020   (0x0001)  
	unsigned char                                      UnknownData02_7[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationGetIn
/// Size: 0x0038 (56 bytes) (0x000028 - 0x000060) align 8 pad: 0x0000
struct FZeuzAllocationGetIn : FZeuzAllocationPagination
{ 
	TArray<FString>                                    AllocationIDs;                                              // 0x0028   (0x0010)  
	bool                                               GetDisabled;                                                // 0x0038   (0x0001)  
	bool                                               GetEnabled;                                                 // 0x0039   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x003A   (0x0006)  MISSED
	FString                                            Region;                                                     // 0x0040   (0x0010)  
	FString                                            OS;                                                         // 0x0050   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationPayloadPortMapping
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 4 pad: 0x0000
struct FZeuzAllocationPayloadPortMapping
{ 
	int32_t                                            InternalPort;                                               // 0x0000   (0x0004)  
	int32_t                                            ExternalPort;                                               // 0x0004   (0x0004)  
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationPayloadInfo
/// Size: 0x00E8 (232 bytes) (0x000000 - 0x0000E8) align 8 pad: 0x0000
struct FZeuzAllocationPayloadInfo
{ 
	FString                                            PayloadID;                                                  // 0x0000   (0x0010)  
	FString                                            MachineID;                                                  // 0x0010   (0x0010)  
	FString                                            AllocationID;                                               // 0x0020   (0x0010)  
	FString                                            EnvID;                                                      // 0x0030   (0x0010)  
	TArray<FString>                                    Regions;                                                    // 0x0040   (0x0010)  
	FZeuzPayloadDef                                    PayloadDef;                                                 // 0x0050   (0x0040)  
	bool                                               Active;                                                     // 0x0090   (0x0001)  
	bool                                               Reserved;                                                   // 0x0091   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0092   (0x0006)  MISSED
	FString                                            IP;                                                         // 0x0098   (0x0010)  
	TArray<FZeuzAllocationPayloadPortMapping>          PortMapping;                                                // 0x00A8   (0x0010)  
	FString                                            Handling;                                                   // 0x00B8   (0x0010)  
	FString                                            LocationType;                                               // 0x00C8   (0x0010)  
	FZeuzTimestamp                                     Created;                                                    // 0x00D8   (0x0008)  
	FZeuzTimestamp                                     Modified;                                                   // 0x00E0   (0x0008)  
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationRegionCount
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzAllocationRegionCount
{ 
	FString                                            RegionID;                                                   // 0x0000   (0x0010)  
	int32_t                                            Count;                                                      // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationRequestServiceIn
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 pad: 0x0000
struct FZeuzAllocationRequestServiceIn
{ 
	FString                                            AllocationID;                                               // 0x0000   (0x0010)  
	TArray<FZeuzAllocationRegionCount>                 RegionCount;                                                // 0x0010   (0x0010)  
	int32_t                                            TimeoutSeconds;                                             // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzAllocationUpdateIn
/// Size: 0x0130 (304 bytes) (0x000000 - 0x000130) align 8 pad: 0x0000
struct FZeuzAllocationUpdateIn
{ 
	FString                                            AllocationID;                                               // 0x0000   (0x0010)  
	FZeuzAllocationDef                                 AllocationDef;                                              // 0x0010   (0x0118)  
	bool                                               Enabled;                                                    // 0x0128   (0x0001)  
	unsigned char                                      UnknownData00_7[0x7];                                       // 0x0129   (0x0007)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzEchoOut
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzEchoOut
{ 
	FString                                            Text;                                                       // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzEcho2Out
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzEcho2Out
{ 
	FString                                            Text;                                                       // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzEchoIn
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzEchoIn
{ 
	FString                                            Text;                                                       // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzEcho2In
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzEcho2In
{ 
	FString                                            Text;                                                       // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzEcho3In
/// Size: 0x0004 (4 bytes) (0x000000 - 0x000004) align 4 pad: 0x0000
struct FZeuzEcho3In
{ 
	int32_t                                            Num;                                                        // 0x0000   (0x0004)  
};

/// Struct /Script/Zeuzsdk.ZeuzImageManagerPublishOutput
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FZeuzImageManagerPublishOutput
{ 
	FString                                            ImageHash;                                                  // 0x0000   (0x0010)  
	FString                                            ImageURL;                                                   // 0x0010   (0x0010)  
	FString                                            Version;                                                    // 0x0020   (0x0010)  
	FString                                            Description;                                                // 0x0030   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzImagemanagerPublishState
/// Size: 0x0080 (128 bytes) (0x000000 - 0x000080) align 8 pad: 0x0000
struct FZeuzImagemanagerPublishState
{ 
	FString                                            ImageID;                                                    // 0x0000   (0x0010)  
	FString                                            ImageHash;                                                  // 0x0010   (0x0010)  
	FString                                            State;                                                      // 0x0020   (0x0010)  
	FString                                            Message;                                                    // 0x0030   (0x0010)  
	FZeuzImageManagerPublishOutput                     Result;                                                     // 0x0040   (0x0040)  
};

/// Struct /Script/Zeuzsdk.ZeuzImageManagerListEntry
/// Size: 0x0048 (72 bytes) (0x000000 - 0x000048) align 8 pad: 0x0000
struct FZeuzImageManagerListEntry
{ 
	FZeuzTimestamp                                     Timestamp;                                                  // 0x0000   (0x0008)  
	FString                                            ImageHash;                                                  // 0x0008   (0x0010)  
	FString                                            ImageURL;                                                   // 0x0018   (0x0010)  
	FString                                            Title;                                                      // 0x0028   (0x0010)  
	FString                                            Version;                                                    // 0x0038   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzImageManagerManifestEntryPart
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 pad: 0x0000
struct FZeuzImageManagerManifestEntryPart
{ 
	FString                                            Hash;                                                       // 0x0000   (0x0010)  
	FString                                            URL;                                                        // 0x0010   (0x0010)  
	int32_t                                            Index;                                                      // 0x0020   (0x0004)  
	int32_t                                            StartByte;                                                  // 0x0024   (0x0004)  
	int32_t                                            Length;                                                     // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_7[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzImageManagerManifestEntry
/// Size: 0x0048 (72 bytes) (0x000000 - 0x000048) align 8 pad: 0x0000
struct FZeuzImageManagerManifestEntry
{ 
	FString                                            Filename;                                                   // 0x0000   (0x0010)  
	int32_t                                            Filesize;                                                   // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            Hash;                                                       // 0x0018   (0x0010)  
	FString                                            URL;                                                        // 0x0028   (0x0010)  
	TArray<FZeuzImageManagerManifestEntryPart>         Parts;                                                      // 0x0038   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzImageManagerManifest
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzImageManagerManifest
{ 
	TArray<FZeuzImageManagerManifestEntry>             Entries;                                                    // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzImageManagerPushPullOutput
/// Size: 0x0030 (48 bytes) (0x000000 - 0x000030) align 8 pad: 0x0000
struct FZeuzImageManagerPushPullOutput
{ 
	FZeuzImageManagerManifest                          Manifest;                                                   // 0x0000   (0x0010)  
	FString                                            ManifestHash;                                               // 0x0010   (0x0010)  
	TArray<FString>                                    TransferHashes;                                             // 0x0020   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzImageManagerPublishInput
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzImageManagerPublishInput
{ 
	FString                                            Description;                                                // 0x0000   (0x0010)  
	FString                                            Version;                                                    // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzImageManagerPullInput
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 8 pad: 0x0000
struct FZeuzImageManagerPullInput
{ 
	FString                                            ImageHash;                                                  // 0x0000   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzImageManagerPresignedFileUrlIn
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzImageManagerPresignedFileUrlIn
{ 
	FString                                            ManifestHash;                                               // 0x0000   (0x0010)  
	FString                                            Filename;                                                   // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzKVStoreKVEntry
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 pad: 0x0000
struct FZeuzKVStoreKVEntry
{ 
	int32_t                                            ID;                                                         // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0004   (0x0004)  MISSED
	FString                                            Partition;                                                  // 0x0008   (0x0010)  
	FString                                            Key;                                                        // 0x0018   (0x0010)  
	FString                                            Value;                                                      // 0x0028   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzKVStoreKey
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 pad: 0x0000
struct FZeuzKVStoreKey
{ 
	FString                                            Partition;                                                  // 0x0000   (0x0010)  
	FString                                            Key;                                                        // 0x0010   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzKVStoreDelIn
/// Size: 0x0000 (0 bytes) (0x000020 - 0x000020) align 8 pad: 0x0000
struct FZeuzKVStoreDelIn : FZeuzKVStoreKey
{ 
};

/// Struct /Script/Zeuzsdk.ZeuzKVStoreKeyValue
/// Size: 0x0010 (16 bytes) (0x000020 - 0x000030) align 8 pad: 0x0000
struct FZeuzKVStoreKeyValue : FZeuzKVStoreKey
{ 
	FString                                            Value;                                                      // 0x0020   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzKVStorePutIn
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
struct FZeuzKVStorePutIn : FZeuzKVStoreKeyValue
{ 
};

/// Struct /Script/Zeuzsdk.ZeuzLobbyStateBase
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 pad: 0x0000
struct FZeuzLobbyStateBase
{ 
	FString                                            LobbyID;                                                    // 0x0000   (0x0010)  
	int32_t                                            UsersMax;                                                   // 0x0010   (0x0004)  
	bool                                               Private;                                                    // 0x0014   (0x0001)  
	bool                                               HasStarted;                                                 // 0x0015   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0016   (0x0002)  MISSED
	FString                                            Compatibility;                                              // 0x0018   (0x0010)  
	FZeuzVariant                                       Params;                                                     // 0x0028   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzLobbyStateOut
/// Size: 0x0020 (32 bytes) (0x000038 - 0x000058) align 8 pad: 0x0000
struct FZeuzLobbyStateOut : FZeuzLobbyStateBase
{ 
	FString                                            InboxID;                                                    // 0x0038   (0x0010)  
	bool                                               HasPassword;                                                // 0x0048   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0049   (0x0003)  MISSED
	int32_t                                            UsersCur;                                                   // 0x004C   (0x0004)  
	int32_t                                            Version;                                                    // 0x0050   (0x0004)  
	unsigned char                                      UnknownData01_7[0x4];                                       // 0x0054   (0x0004)  MISSED
};

/// Struct /Script/Zeuzsdk.ZeuzLobbyUser
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 pad: 0x0000
struct FZeuzLobbyUser
{ 
	FString                                            UserID;                                                     // 0x0000   (0x0010)  
	FString                                            DisplayName;                                                // 0x0010   (0x0010)  
	FString                                            Team;                                                       // 0x0020   (0x0010)  
	FString                                            Slot;                                                       // 0x0030   (0x0010)  
	FString                                            Info;                                                       // 0x0040   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzLobbyUserBase
/// Size: 0x0028 (40 bytes) (0x000050 - 0x000078) align 8 pad: 0x0000
struct FZeuzLobbyUserBase : FZeuzLobbyUser
{ 
	bool                                               Ready;                                                      // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0051   (0x0007)  MISSED
	FZeuzVariant                                       Params;                                                     // 0x0058   (0x0010)  
	FZeuzTimestamp                                     Created;                                                    // 0x0068   (0x0008)  
	FZeuzTimestamp                                     Updated;                                                    // 0x0070   (0x0008)  
};

/// Struct /Script/Zeuzsdk.ZeuzLobbyUsersOut
/// Size: 0x0078 (120 bytes) (0x000000 - 0x000078) align 8 pad: 0x0000
struct FZeuzLobbyUsersOut
{ 
	FZeuzLobbyStateOut                                 Lobby;                                                      // 0x0000   (0x0058)  
	TArray<FZeuzLobbyUserBase>                         Users;                                                      // 0x0058   (0x0010)  
	FString                                            ServerConnect;                                              // 0x0068   (0x0010)  
};

/// Struct /Script/Zeuzsdk.ZeuzLobbyQueryOut
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 pad: 0x0000
struct FZeuzLobbyQueryOut
{ 
	TArray<FZeuzLobbyStateOut>                         Results;                                                    // 0x0000   (0x0010)  
